<!DOCTYPE HTML>
<html lang="en" >
    
    <head>
        
        <meta charset="UTF-8">
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <title>第七章 | Introduction</title>
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <meta name="description" content="">
        <meta name="generator" content="GitBook 2.6.7">
        
        
        <meta name="HandheldFriendly" content="true"/>
        <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
        <meta name="apple-mobile-web-app-capable" content="yes">
        <meta name="apple-mobile-web-app-status-bar-style" content="black">
        <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
        <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">
        
    <link rel="stylesheet" href="gitbook/style.css">
    
        
        <link rel="stylesheet" href="gitbook/plugins/gitbook-plugin-highlight/website.css">
        
    
        
        <link rel="stylesheet" href="gitbook/plugins/gitbook-plugin-search/search.css">
        
    
        
        <link rel="stylesheet" href="gitbook/plugins/gitbook-plugin-fontsettings/website.css">
        
    
    

        
    
    
    <link rel="next" href="./chapter8.html" />
    
    
    <link rel="prev" href="./chapter6.html" />
    

        
    </head>
    <body>
        
        
    <div class="book"
        data-level="7"
        data-chapter-title="第七章"
        data-filepath="chapter7.md"
        data-basepath="."
        data-revision="Fri Dec 28 2018 21:58:59 GMT+0800 (CST)"
        data-innerlanguage="">
    

<div class="book-summary">
    <nav role="navigation">
        <ul class="summary">
            
            
            
            

            

            
    
        <li class="chapter " data-level="0" data-path="index.html">
            
                
                    <a href="./index.html">
                
                        <i class="fa fa-check"></i>
                        
                        Introduction
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="1" data-path="chapter1.html">
            
                
                    <a href="./chapter1.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>1.</b>
                        
                        第一章
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="2" data-path="chapter2.html">
            
                
                    <a href="./chapter2.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>2.</b>
                        
                        第二章
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="3" data-path="chapter3.html">
            
                
                    <a href="./chapter3.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>3.</b>
                        
                        第三章
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="4" data-path="chapter4.html">
            
                
                    <a href="./chapter4.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>4.</b>
                        
                        第四章
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="5" data-path="chapter5.html">
            
                
                    <a href="./chapter5.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>5.</b>
                        
                        第五章
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="6" data-path="chapter6.html">
            
                
                    <a href="./chapter6.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>6.</b>
                        
                        第六章
                    </a>
            
            
        </li>
    
        <li class="chapter active" data-level="7" data-path="chapter7.html">
            
                
                    <a href="./chapter7.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>7.</b>
                        
                        第七章
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="8" data-path="chapter8.html">
            
                
                    <a href="./chapter8.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>8.</b>
                        
                        第八章
                    </a>
            
            
        </li>
    


            
            <li class="divider"></li>
            <li>
                <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
                    Published with GitBook
                </a>
            </li>
            
        </ul>
    </nav>
</div>

    <div class="book-body">
        <div class="body-inner">
            <div class="book-header" role="navigation">
    <!-- Actions Left -->
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="./" >Introduction</a>
    </h1>
</div>

            <div class="page-wrapper" tabindex="-1" role="main">
                <div class="page-inner">
                
                
                    <section class="normal" id="section-">
                    
                        <h1 id="&#x7B2C;&#x4E03;&#x7AE0;-hello&#x7684;&#x5B58;&#x50A8;&#x7BA1;&#x7406;">&#x7B2C;&#x4E03;&#x7AE0; Hello&#x7684;&#x5B58;&#x50A8;&#x7BA1;&#x7406;</h1>
<h2 id="71-hello&#x7684;&#x5B58;&#x50A8;&#x5668;&#x5730;&#x5740;&#x7A7A;&#x95F4;">7.1 hello&#x7684;&#x5B58;&#x50A8;&#x5668;&#x5730;&#x5740;&#x7A7A;&#x95F4;</h2>
<p><strong>&#x7269;&#x7406;&#x5730;&#x5740;</strong>&#x662F;&#x52A0;&#x8F7D;&#x5230;&#x5185;&#x5B58;&#x5730;&#x5740;&#x5BC4;&#x5B58;&#x5668;&#x4E2D;&#x7684;&#x5730;&#x5740;&#xFF0C;&#x5185;&#x5B58;&#x5355;&#x5143;&#x7684;&#x771F;&#x6B63;&#x5730;&#x5740;&#x3002;&#x5728;&#x524D;&#x7AEF;&#x603B;&#x7EBF;&#x4E0A;&#x4F20;&#x8F93;&#x7684;&#x5185;&#x5B58;&#x5730;&#x5740;&#x90FD;&#x662F;&#x7269;&#x7406;&#x5185;&#x5B58;&#x5730;&#x5740;&#xFF0C;&#x7F16;&#x53F7;&#x4ECE;0&#x5F00;&#x59CB;&#x4E00;&#x76F4;&#x5230;&#x53EF;&#x7528;&#x7269;&#x7406;&#x5185;&#x5B58;&#x7684;&#x6700;&#x9AD8;&#x7AEF;&#x3002;&#x8FD9;&#x4E9B;&#x6570;&#x5B57;&#x88AB;&#x5317;&#x6865;(Nortbridge chip)&#x6620;&#x5C04;&#x5230;&#x5B9E;&#x9645;&#x7684;&#x5185;&#x5B58;&#x6761;&#x4E0A;&#x3002;&#x7269;&#x7406;&#x5730;&#x5740;&#x662F;&#x660E;&#x786E;&#x7684;&#x3001;&#x6700;&#x7EC8;&#x7528;&#x5728;&#x603B;&#x7EBF;&#x4E0A;&#x7684;&#x7F16;&#x53F7;&#xFF0C;&#x4E0D;&#x5FC5;&#x8F6C;&#x6362;&#xFF0C;&#x4E0D;&#x5FC5;&#x5206;&#x9875;&#xFF0C;&#x4E5F;&#x6CA1;&#x6709;&#x7279;&#x6743;&#x7EA7;&#x68C0;&#x67E5;(no translation, no paging, no privilege checks)&#x3002;</p>
<p>&#x8BA1;&#x7B97;&#x673A;&#x7CFB;&#x7EDF;&#x7684;&#x4E3B;&#x5B58;&#x88AB;&#x7EC4;&#x7EC7;&#x6210;&#x4E00;&#x4E2A;&#x7531;M&#x4E2A;&#x8FDE;&#x7EED;&#x7684;&#x5B57;&#x8282;&#x5927;&#x5C0F;&#x7684;&#x5355;&#x5143;&#x7EC4;&#x6210;&#x7684;&#x6570;&#x7EC4;&#x3002;&#x6BCF;&#x5B57;&#x8282;&#x90FD;&#x6709;&#x4E00;&#x4E2A;&#x552F;&#x4E00;&#x7684;<strong>&#x7269;&#x7406;&#x5730;&#x5740;</strong>&#x3002;&#x7B2C;&#x4E00;&#x4E2A;&#x5B57;&#x8282;&#x7684;&#x5730;&#x5740;&#x4E3A;0&#xFF0C;&#x63A5;&#x4E0B;&#x6765;&#x7684;&#x5B57;&#x8282;&#x5730;&#x5740;&#x4E3A;1&#xFF0C;&#x518D;&#x4E0B;&#x4E00;&#x4E2A;&#x4E3A;2&#xFF0C;&#x4F9D;&#x6B64;&#x7C7B;&#x63A8;&#x3002;&#x7ED9;&#x5B9A;&#x8FD9;&#x79CD;&#x7B80;&#x5355;&#x7684;&#x7ED3;&#x6784;&#xFF0C;CPU&#x8BBF;&#x95EE;&#x5185;&#x5B58;&#x7684;&#x6700;&#x81EA;&#x7136;&#x7684;&#x65B9;&#x5F0F;&#x5C31;&#x662F;&#x4F7F;&#x7528;&#x7269;&#x7406;&#x5730;&#x5740;&#x3002;&#x6211;&#x4EEC;&#x628A;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x79F0;&#x4E3A;<strong>&#x7269;&#x7406;&#x5BFB;&#x5740;</strong>&#x3002;&#x65E9;&#x671F;&#x7684;PC&#x5B9E;&#x7528;&#x7269;&#x7406;&#x5BFB;&#x5740; &#xFF0C;&#x800C;&#x4E14;&#x8BF8;&#x5982;&#x6570;&#x5B57;&#x4FE1;&#x53F7;&#x5904;&#x7406;&#x5668;&#x3001;&#x5D4C;&#x5165;&#x5F0F;&#x5FAE;&#x63A7;&#x5236;&#x5668;&#x4EE5;&#x53CA;Cray&#x8D85;&#x7EA7;&#x8BA1;&#x7B97;&#x673A;&#x8FD9;&#x6837;&#x7684;&#x7CFB;&#x7EDF;&#x4ECD;&#x7136;&#x4F7F;&#x7528;&#x8FD9;&#x6837;&#x7684;&#x5BFB;&#x5740;&#x65B9;&#x5F0F;&#x3002;&#x7136;&#x800C;&#x73B0;&#x4EE3;&#x5904;&#x7406;&#x5668;&#x4F7F;&#x7528;&#x7684;&#x662F;&#x4E00;&#x79CD;&#x79F0;&#x4E3A;<strong>&#x865A;&#x62DF;&#x5BFB;&#x5740;</strong>&#x7684;&#x5BFB;&#x5740;&#x5F62;&#x5F0F;&#x3002;</p>
<p>&#x4F7F;&#x7528;&#x865A;&#x62DF;&#x5BFB;&#x5740;&#xFF0C;CPU&#x901A;&#x8FC7;&#x751F;&#x6210;&#x4E00;&#x4E2A;<strong>&#x865A;&#x62DF;&#x5730;&#x5740;</strong>&#x6765;&#x8BBF;&#x95EE;&#x4E3B;&#x5B58;&#xFF0C;&#x8FD9;&#x4E2A;&#x865A;&#x62DF;&#x5730;&#x5740;&#x5728;&#x88AB;&#x9001;&#x5230;&#x5185;&#x5B58;&#x4E4B;&#x524D;&#x5148;&#x8F6C;&#x6362;&#x6210;&#x9002;&#x5F53;&#x7684;&#x7269;&#x7406;&#x5730;&#x5740;&#x3002;&#x5C06;&#x4E00;&#x4E2A;&#x865A;&#x62DF;&#x5730;&#x5740;&#x8F6C;&#x6362;&#x4E3A;&#x7269;&#x7406;&#x5730;&#x5740;&#x7684;&#x4EFB;&#x52A1;&#x53EB;&#x505A;<strong>&#x5730;&#x5740;&#x7FFB;&#x8BD1;</strong>&#x3002;&#x5730;&#x5740;&#x7FFB;&#x8BD1;&#x9700;&#x8981;CPU&#x786C;&#x4EF6;&#x548C;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x4E4B;&#x95F4;&#x7684;&#x7D27;&#x5BC6;&#x5408;&#x4F5C;&#x3002;CPU&#x82AF;&#x7247;&#x4E0A;&#x53EB;&#x505A;<strong>&#x5185;&#x5B58;&#x7BA1;&#x7406;&#x5355;&#x5143;</strong>&#x7684;&#x4E13;&#x7528;&#x786C;&#x4EF6;&#xFF0C;&#x5229;&#x7528;&#x5B58;&#x653E;&#x5728;&#x4E3B;&#x5B58;&#x4E2D;&#x7684;&#x67E5;&#x8BE2;&#x8868;&#x6765;&#x52A8;&#x6001;&#x7FFB;&#x8BD1;&#x865A;&#x62DF;&#x5730;&#x5740;&#xFF0C;&#x8BE5;&#x8868;&#x7684;&#x5185;&#x5BB9;&#x7531;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x7BA1;&#x7406;&#x3002;</p>
<p><strong>&#x903B;&#x8F91;&#x5730;&#x5740;</strong>&#x662F;CPU&#x6240;&#x751F;&#x6210;&#x7684;&#x5730;&#x5740;&#x3002;&#x903B;&#x8F91;&#x5730;&#x5740;&#x662F;&#x5185;&#x90E8;&#x548C;&#x7F16;&#x7A0B;&#x4F7F;&#x7528;&#x7684;&#x3001;&#x5E76;&#x4E0D;&#x552F;&#x4E00;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x4F60;&#x5728;&#x8FDB;&#x884C;C&#x8BED;&#x8A00;&#x6307;&#x9488;&#x7F16;&#x7A0B;&#x4E2D;&#xFF0C;&#x53EF;&#x4EE5;&#x8BFB;&#x53D6;&#x6307;&#x9488;&#x53D8;&#x91CF;&#x672C;&#x8EAB;&#x503C;(&amp;&#x64CD;&#x4F5C;)&#xFF0C;&#x5B9E;&#x9645;&#x4E0A;&#x8FD9;&#x4E2A;&#x503C;&#x5C31;&#x662F;&#x903B;&#x8F91;&#x5730;&#x5740;&#xFF0C;&#x5B83;&#x662F;&#x76F8;&#x5BF9;&#x4E8E;&#x4F60;&#x5F53;&#x524D;&#x8FDB;&#x7A0B;&#x6570;&#x636E;&#x6BB5;&#x7684;&#x5730;&#x5740;&#xFF08;&#x504F;&#x79FB;&#x5730;&#x5740;&#xFF09;&#xFF0C;&#x4E0D;&#x548C;&#x7EDD;&#x5BF9;&#x7269;&#x7406;&#x5730;&#x5740;&#x76F8;&#x5E72;&#x3002;</p>
<p><strong>&#x7EBF;&#x6027;&#x5730;&#x5740;</strong>&#x662F;&#x4E00;&#x4E2A;32&#x4F4D;&#x65E0;&#x7B26;&#x53F7;&#x6574;&#x6570;&#xFF0C;&#x53EF;&#x4EE5;&#x7528;&#x6765;&#x8868;&#x793A;&#x9AD8;&#x8FBE;4GB&#x7684;&#x5730;&#x5740;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#xFF0C;&#x9AD8;&#x8FBE;4294967296&#x4E2A;&#x5185;&#x5B58;&#x5355;&#x5143;&#x3002;&#x7EBF;&#x6027;&#x5730;&#x5740;&#x901A;&#x5E38;&#x7528;&#x5341;&#x516D;&#x8FDB;&#x5236;&#x6570;&#x5B57;&#x8868;&#x793A;&#xFF0C;&#x503C;&#x7684;&#x8303;&#x56F4;&#x4ECE;0x00000000&#x5230;0xffffffff&#xFF09;&#x3002;&#x7A0B;&#x5E8F;&#x4EE3;&#x7801;&#x4F1A;&#x4EA7;&#x751F;&#x903B;&#x8F91;&#x5730;&#x5740;&#xFF0C;&#x901A;&#x8FC7;&#x903B;&#x8F91;&#x5730;&#x5740;&#x53D8;&#x6362;&#x5C31;&#x53EF;&#x4EE5;&#x751F;&#x6210;&#x4E00;&#x4E2A;&#x7EBF;&#x6027;&#x5730;&#x5740;&#x3002;&#x5982;&#x679C;&#x542F;&#x7528;&#x4E86;&#x5206;&#x9875;&#x673A;&#x5236;&#xFF0C;&#x90A3;&#x4E48;&#x7EBF;&#x6027;&#x5730;&#x5740;&#x53EF;&#x4EE5;&#x518D;&#x7ECF;&#x8FC7;&#x53D8;&#x6362;&#x4EE5;&#x4EA7;&#x751F;&#x4E00;&#x4E2A;&#x7269;&#x7406;&#x5730;&#x5740;&#x3002;&#x5F53;&#x91C7;&#x7528;4KB&#x5206;&#x9875;&#x5927;&#x5C0F;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x7EBF;&#x6027;&#x5730;&#x5740;&#x7684;&#x9AD8;20&#x4F4D;&#x4E3A;&#x9875;&#x76EE;&#x5F55;&#x9879;&#x5728;&#x9875;&#x76EE;&#x5F55;&#x8868;&#x4E2D;&#x7684;&#x7F16;&#x53F7;&#xFF0C;&#x4E2D;&#x95F4;&#x5341;&#x4F4D;&#x4E3A;&#x9875;&#x8868;&#x4E2D;&#x7684;&#x9875;&#x53F7;&#xFF0C;&#x5176;&#x4F4E;12&#x4F4D;&#x5219;&#x4E3A;&#x504F;&#x79FB;&#x5730;&#x5740;&#x3002;&#x5982;&#x679C;&#x662F;&#x4F7F;&#x7528;4MB&#x5206;&#x9875;&#x673A;&#x5236;&#xFF0C;&#x5219;&#x9AD8;10&#x4F4D;&#x9875;&#x53F7;&#xFF0C;&#x4F4E;22&#x4F4D;&#x4E3A;&#x504F;&#x79FB;&#x5730;&#x5740;&#x3002;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x542F;&#x7528;&#x5206;&#x9875;&#x673A;&#x5236;&#xFF0C;&#x90A3;&#x4E48;<strong>&#x7EBF;&#x6027;&#x5730;&#x5740;</strong>&#x76F4;&#x63A5;&#x5C31;&#x662F;&#x7269;&#x7406;&#x5730;&#x5740;&#x3002;</p>
<p><img src="Chapter7/&#x5C4F;&#x5E55;&#x5FEB;&#x7167; 2018-12-27 &#x4E0B;&#x5348;7.51.13.png" alt="&#x5C4F;&#x5E55;&#x5FEB;&#x7167; 2018-12-27 &#x4E0B;&#x5348;7.51.13"></p>
<h2 id="72-intel&#x903B;&#x8F91;&#x5730;&#x5740;&#x5230;&#x7EBF;&#x6027;&#x5730;&#x5740;&#x7684;&#x53D8;&#x6362;&#x6BB5;&#x5F0F;&#x7BA1;&#x7406;">7.2 Intel&#x903B;&#x8F91;&#x5730;&#x5740;&#x5230;&#x7EBF;&#x6027;&#x5730;&#x5740;&#x7684;&#x53D8;&#x6362;-&#x6BB5;&#x5F0F;&#x7BA1;&#x7406;</h2>
<p>X86&#x662F;&#x6307;Intel&#x4ECE;16&#x4F4D;&#x5FAE;&#x5904;&#x7406;&#x5668;&#x5F00;&#x59CB;&#x7684;&#x6574;&#x4E2A;CPU&#x82AF;&#x7247;&#x7CFB;&#x5217;&#xFF0C;&#x4E3B;&#x8981;8086&#xFF0C;8088&#xFF0C;80186&#xFF0C;80286&#xFF0C;80386&#xFF0C;80486&#xFF0C;&#x4EE5;&#x53CA;&#x4EE5;&#x540E;&#x5404;&#x79CD;&#x578B;&#x53F7;&#x7684;Pentium&#x82AF;&#x7247;&#xFF0C;8086&#x548C;8088&#x4E3A;&#x662F;16&#x4F4D;&#x5904;&#x7406;&#x5668;&#xFF0C;20&#x6839;&#x5730;&#x5740;&#x7EBF;&#xFF0C;&#xFF0C;80286&#x662F;&#x4E2A;&#x8FC7;&#x6E21;&#x4EA7;&#x54C1;&#xFF0C;16&#x4F4D;&#x5904;&#x7406;&#x5668;&#xFF0C;24&#x6839;&#x5730;&#x5740;&#x7EBF;&#xFF0C;&#x6709;&#x4E0D;&#x90A3;&#x4E48;&#x5065;&#x5168;&#x7684;&#x4FDD;&#x62A4;&#x6A21;&#x5F0F;&#xFF0C;&#x6240;&#x4EE5;&#x8BF4;&#x5B83;&#x7684;&#x5386;&#x53F2;&#x610F;&#x4E49;&#x5728;&#x4E8E;&#xFF1A;&#x5728;&#x5BFB;&#x5740;&#x4E0A;&#x5F00;&#x59CB;&#x4E86;&#x4ECE;&#x5B9E;&#x5730;&#x5740;&#x6A21;&#x5F0F;&#x5230;&#x4FDD;&#x62A4;&#x6A21;&#x5F0F;&#x7684;&#x8FC7;&#x6E21;&#x3002;&#x4ECE;80386&#x5F00;&#x59CB;&#x4E3A;32&#x4F4D;&#x5904;&#x7406;&#x5668;&#xFF0C;32&#x6839;&#x5730;&#x5740;&#x7EBF;&#x3002;&#x5B9E;&#x73B0;&#x4E86;&#x4FDD;&#x62A4;&#x6A21;&#x5F0F;&#x53CA;&#x9875;&#x5F0F;&#x5185;&#x5B58;&#x7BA1;&#x7406;&#x3002;</p>
<p>&#x800C;&#x5B9E;&#x6A21;&#x5F0F;&#x548C;&#x4FDD;&#x62A4;&#x6A21;&#x5F0F;&#x4E5F;&#x6709;&#x6240;&#x4E0D;&#x540C;&#xFF1A;</p>
<p>&#x5B9E;&#x6A21;&#x5F0F;&#x4E5F;&#x79F0;&#x4E3A;&#x5B9E;&#x5730;&#x5740;&#x6A21;&#x5F0F;&#xFF0C;&#x5BF9;&#x4E8E;8086/8088&#x6765;&#x8BF4;&#x8BA1;&#x7B97;&#x5B9E;&#x9645;&#x5730;&#x5740;&#x662F;&#x7528;&#x7EDD;&#x5BF9;&#x5730;&#x5740;&#x5BF9;1M&#x6C42;&#x6A21;&#x3002;8086&#x7684;&#x5730;&#x5740;&#x7EBF;&#x7684;&#x7269;&#x7406;&#x7ED3;&#x6784;&#xFF1A;20&#x6839;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x5B83;&#x53EF;&#x4EE5;&#x7269;&#x7406;&#x5BFB;&#x5740;&#x7684;&#x5185;&#x5B58;&#x8303;&#x56F4;&#x4E3A;2^20&#x4E2A;&#x5B57;&#x8282;&#xFF0C;&#x5373;1 M&#x7A7A;&#x95F4;&#xFF0C;&#x4F46;&#x7531;&#x4E8E;8086/8088&#x6240;&#x4F7F;&#x7528;&#x7684;&#x5BC4;&#x5B58;&#x5668;&#x90FD;&#x662F;16&#x4F4D;&#xFF0C;&#x80FD;&#x591F;&#x8868;&#x793A;&#x7684;&#x5730;&#x5740;&#x8303;&#x56F4;&#x53EA;&#x6709;0-64K&#xFF0C;&#x6240;&#x4EE5;&#x4E3A;&#x4E86;&#x5728;8086/8088&#x4E0B;&#x80FD;&#x591F;&#x8BBF;&#x95EE;1M&#x5185;&#x5B58;&#xFF0C;Intel&#x91C7;&#x53D6;&#x4E86;&#x5206;&#x6BB5;&#x5BFB;&#x5740;&#x7684;&#x6A21;&#x5F0F;&#xFF1A;16&#x4F4D;&#x6BB5;&#x57FA;&#x5730;&#x5740;:16&#x4F4D;&#x504F;&#x79FB;EA&#x3002;&#x5176;&#x7EDD;&#x5BF9;&#x5730;&#x5740;&#x8BA1;&#x7B97;&#x65B9;&#x6CD5;&#x4E3A;&#xFF1A;16&#x4F4D;&#x57FA;&#x5730;&#x5740;&#x5DE6;&#x79FB;4&#x4F4D;+16&#x4F4D;&#x504F;&#x79FB;=20&#x4F4D;&#x5730;&#x5740;&#x3002;&#x7531;&#x4E8E;&#x5B9E;&#x6A21;&#x5F0F;&#x4E0B;&#xFF0C;&#x4EFB;&#x4F55;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x90FD;&#x80FD;&#x591F;&#x8BBF;&#x95EE;&#x4ECE;&#x6BB5;&#x5BC4;&#x5B58;&#x5668;&#x6240;&#x786E;&#x5B9A;&#x7684;&#x57FA;&#x5730;&#x5740;&#x8FDB;&#x7A0B;&#x7684;64K&#x5B57;&#x8282;&#x7684;&#x7684;&#x8FDE;&#x7EED;&#x5730;&#x5740;&#x7A7A;&#x95F4;&#xFF0C;&#x5E76;&#x4E14;&#x53EF;&#x4EE5;&#x968F;&#x610F;&#x66F4;&#x6539;&#x6BB5;&#x5BC4;&#x5B58;&#x5668;&#x7684;&#x5185;&#x5BB9;&#x4ECE;&#x800C;&#x8FBE;&#x5230;&#x8BBF;&#x95EE;&#x5185;&#x5B58;&#x4E2D;&#x4EFB;&#x4E00;&#x4E2A;&#x5355;&#x5143;&#xFF0C;&#x800C;&#x4E0D;&#x53D7;&#x5230;&#x4EFB;&#x4F55;&#x9650;&#x5236;&#xFF0C;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x7F3A;&#x4E4F;&#x5BF9;&#x5185;&#x5B58;&#x8BBF;&#x95EE;&#x7684;&#x9650;&#x5236;&#xFF0C;&#x6216;&#x8005;&#x8BF4;&#x4FDD;&#x62A4;&#x3002;</p>
<p>&#x800C;&#x4FDD;&#x62A4;&#x6A21;&#x5F0F;&#x4E2D;&#xFF0C;&#x5185;&#x5B58;&#x7684;&#x7BA1;&#x7406;&#x6A21;&#x5F0F;&#x5206;&#x4E3A;&#x4E24;&#x79CD;&#xFF0C;&#x6BB5;&#x6A21;&#x5F0F;&#x548C;&#x9875;&#x6A21;&#x5F0F;&#xFF0C;&#x5176;&#x4E2D;&#x9875;&#x6A21;&#x5F0F;&#x4E5F;&#x662F;&#x57FA;&#x4E8E;&#x6BB5;&#x6A21;&#x5F0F;&#x7684;&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x4FDD;&#x62A4;&#x6A21;&#x5F0F;&#x7684;&#x5185;&#x5B58;&#x7BA1;&#x7406;&#x6A21;&#x5F0F;&#x4E8B;&#x5B9E;&#x4E0A;&#x662F;&#xFF1A;&#x7EAF;&#x6BB5;&#x6A21;&#x5F0F;&#x548C;&#x6BB5;&#x9875;&#x5F0F;&#x3002;&#x8FDB;&#x4E00;&#x6B65;&#x8BF4;&#xFF0C;&#x6BB5;&#x6A21;&#x5F0F;&#x662F;&#x5FC5;&#x4E0D;&#x53EF;&#x5C11;&#x7684;&#xFF0C;&#x800C;&#x9875;&#x6A21;&#x5F0F;&#x5219;&#x662F;&#x53EF;&#x9009;&#x7684;&#x2014;&#x2014;&#x5982;&#x679C;&#x4F7F;&#x7528;&#x9875;&#x6A21;&#x5F0F;&#xFF0C;&#x5219;&#x662F;&#x6BB5;&#x9875;&#x5F0F;&#xFF1B;&#x5426;&#x5219;&#x8FD9;&#x662F;&#x7EAF;&#x6BB5;&#x6A21;&#x5F0F;&#x3002;</p>
<p><strong>&#x6BB5;&#x9009;&#x62E9;&#x5668;</strong> : 32&#x4F4D;&#x6C47;&#x7F16;&#x4E2D;16&#x4F4D;&#x6BB5;&#x5BC4;&#x5B58;&#x5668;(CS&#x3001;DS&#x3001;ES&#x3001;SS&#x3001;FS&#x3001;GS)&#x4E2D;&#x4E0D;&#x518D;&#x5B58;&#x653E;&#x6BB5;&#x57FA;&#x5740;,&#x800C; &#x662F;&#x6BB5;&#x63CF;&#x8FF0;&#x7B26;&#x5728;&#x6BB5;&#x63CF;&#x8FF0;&#x7B26;&#x8868;&#x4E2D;&#x7684;&#x7D22;&#x5F15;&#x503C;,D3-D15&#x4F4D;&#x662F;&#x7D22;&#x5F15;&#x503C;,D0-D1&#x4F4D;&#x662F;&#x4F18;&#x5148;&#x7EA7;(RPL)&#x7528;&#x4E8E;&#x7279;&#x6743;&#x68C0;&#x67E5;,D2&#x4F4D;&#x662F;&#x63CF;&#x8FF0;&#x7B26;&#x8868;&#x5F15;&#x7528;&#x6307;&#x793A;&#x4F4D;TI,TI=0&#x6307; &#x793A;&#x4ECE;&#x5168;&#x5C40;&#x63CF;&#x8FF0;&#x8868;GDT&#x4E2D;&#x8BFB;&#x53D6;&#x63CF;&#x8FF0;&#x7B26;&#xFF0C;TI=1&#x6307;&#x793A;&#x4ECE;&#x5C40;&#x90E8;&#x63CF;&#x8FF0;&#x7B26;&#x4E2D;LDT&#x4E2D;&#x8BFB;&#x53D6;&#x63CF;&#x8FF0;&#x7B26;&#x3002;&#x8FD9;&#x4E9B;&#x4FE1;&#x606F;&#x603B;&#x79F0;&#x6BB5;&#x9009;&#x62E9;&#x5668;(&#x6BB5;&#x9009;&#x62E9;&#x5B50;).</p>
<p><strong>&#x6BB5;&#x63CF;&#x8FF0;&#x7B26;</strong> &#xFF1A;8&#x4E2A; &#x5B57;&#x8282;64&#x4F4D;&#xFF0C;&#x6BCF;&#x4E00;&#x4E2A;&#x6BB5;&#x90FD;&#x6709;&#x4E00;&#x4E2A;&#x5BF9;&#x5E94;&#x7684;&#x63CF;&#x8FF0;&#x7B26;&#x3002;&#x6839;&#x636E;&#x63CF;&#x8FF0;&#x7B26;&#x63CF;&#x8FF0;&#x7B26;&#x6240;&#x63CF;&#x8FF0;&#x7684;&#x5BF9;&#x8C61;&#x4E0D;&#x540C;&#xFF0C;&#x63CF;&#x8FF0;&#x7B26;&#x53EF;&#x5206;&#x4E3A;&#x4E09;&#x7C7B;&#xFF1A;&#x50A8;&#x5B58;&#x6BB5;&#x63CF;&#x8FF0;&#x7B26;&#xFF0C;&#x7CFB;&#x7EDF;&#x6BB5;&#x63CF;&#x8FF0;&#x7B26;&#xFF0C;&#x95E8;&#x63CF;&#x8FF0;&#x7B26;(&#x63A7;&#x5236;&#x63CF;&#x8FF0;&#x7B26;)&#x3002;&#x5728;&#x63CF;&#x8FF0;&#x7B26;&#x4E2D;&#x5B9A;&#x4E49;&#x4E86;&#x6BB5;&#x7684;&#x57FA;&#x5740;&#xFF0C;&#x9650;&#x957F;&#x548C;&#x8BBF;&#x95EE;&#x5185;&#x578B;&#x7B49;&#x5C5E;&#x6027;&#x3002;&#x5176;&#x4E2D;&#x57FA;&#x5740;&#x7ED9;&#x51FA;&#x8BE5;&#x6BB5;&#x7684;&#x57FA;&#x7840;&#x5730;&#x5740;&#xFF0C;&#x7528;&#x4E8E;&#x5F62;&#x6210;&#x7EBF;&#x6027;&#x5730;&#x5740;&#xFF1B;&#x9650;&#x957F;&#x8BF4;&#x660E;&#x8BE5;&#x6BB5;&#x7684;&#x957F;&#x5EA6;&#xFF0C;&#x7528;&#x4E8E;&#x5B58;&#x50A8;&#x7A7A;&#x95F4;&#x4FDD;&#x62A4;&#xFF1B;&#x6BB5;&#x5C5E;&#x6027; &#x8BF4;&#x660E;&#x8BE5;&#x6BB5;&#x7684;&#x8BBF;&#x95EE;&#x6743;&#x9650;&#x3001;&#x8BE5;&#x6BB5;&#x5F53;&#x524D;&#x5728;&#x5185;&#x5B58;&#x4E2D;&#x7684;&#x5B58;&#x5728;&#x6027;&#xFF0C;&#x4EE5;&#x53CA;&#x8BE5;&#x6BB5;&#x6240;&#x5728;&#x7684;&#x7279;&#x6743;&#x7EA7;&#x3002;</p>
<p>&#x6BCF;&#x5F53;&#x4E00;&#x4E2A;&#x5BC4;&#x5B58;&#x5668;&#x7684;&#x5185;&#x5BB9;&#x53D1;&#x751F;&#x6539;&#x53D8;&#x65F6;&#xFF0C;CPU&#x5C31;&#x628A;&#x7531;&#x8FD9;&#x6BB5;&#x5BC4;&#x5B58;&#x5668;&#x7684;&#x65B0;&#x5185;&#x5BB9;&#x6240;&#x51B3;&#x5B9A;&#x7684;&#x6BB5;&#x63CF;&#x8FF0;&#x9879;&#x88C5;&#x5165;CPU&#x5185;&#x90E8;&#x7684;&#x4E00;&#x4E2A;&#x5F71;&#x5B50;&#x63CF;&#x8FF0;&#x9879;&#x3002;&#x8FD9;&#x6837;&#xFF0C;CPU&#x4E2D;&#x6709;&#x51E0;&#x4E2A;&#x6BB5;&#x5BC4;&#x5B58;&#x5668;&#x5C31;&#x6709;&#x51E0;&#x4E2A;&#x5F71;&#x5B50;&#x63CF;&#x8FF0;&#x9879;&#xFF0C;&#x6240;&#x4EE5;&#x4E5F;&#x53EF;&#x4EE5;&#x770B;&#x4F5C;&#x662F;&#x5BF9;&#x6BB5;&#x5BC4;&#x5B58;&#x5668;&#x7684;&#x6269;&#x5145;&#x3002;&#x6269;&#x5145;&#x540E;&#x7684;&#x6BB5;&#x5BC4;&#x5B58;&#x5668;&#x5206;&#x6210;&#x4E24;&#x90E8;&#x5206;&#xFF0C;&#x4E00;&#x90E8;&#x5206;&#x662F;&#x53EF;&#x89C1;&#x7684;&#xFF08;&#x5BF9;&#x7A0B;&#x5E8F;&#x800C;&#x8A00;&#xFF09;&#xFF0C;&#x8FD8;&#x4E0E;&#x539F;&#x5148;&#x7684;&#x6BB5;&#x5BC4;&#x5B58;&#x5668;&#x4E00;&#x6837;&#xFF1B;&#x53E6;&#x4E00;&#x90E8;&#x5206;&#x662F;&#x4E0D;&#x53EF;&#x89C1;&#x7684;&#xFF0C;&#x5C31;&#x662F;&#x7528;&#x6765;&#x5B58;&#x653E;&#x5F71;&#x5B50;&#x63CF;&#x8FF0;&#x9879;&#x7684;&#x7A7A;&#x95F4;&#xFF0C;&#x8FD9;&#x4E00;&#x90E8;&#x5206;&#x662F;&#x4E13;&#x4F9B;CPU&#x5185;&#x90E8;&#x4F7F;&#x7528;&#x7684;&#x3002;</p>
<p>&#x5728;80386&#x7684;&#x6BB5;&#x5F0F;&#x5185;&#x5B58;&#x7BA1;&#x7406;&#x7684;&#x57FA;&#x7840;&#x4E0A;&#xFF0C;&#x5982;&#x679C;&#x628A;&#x6BCF;&#x4E2A;&#x6BB5;&#x5BC4;&#x5B58;&#x5668;&#x90FD;&#x6307;&#x5411;&#x540C;&#x4E00;&#x4E2A;&#x63CF;&#x8FF0;&#x9879;&#xFF0C;&#x800C;&#x5728;&#x8BE5;&#x63CF;&#x8FF0;&#x9879;&#x4E2D;&#x5219;&#x5C06;&#x57FA;&#x5730;&#x5740;&#x8BBE;&#x6210;0&#xFF0C;&#x5E76;&#x5C06;&#x6BB5;&#x957F;&#x5EA6;&#x8BBE;&#x6210;&#x6700;&#x5927;&#xFF0C;&#x8FD9;&#x6837;&#x4FBF;&#x5F62;&#x6210;&#x4E00;&#x4E2A;&#x4ECE;0&#x5F00;&#x59CB;&#x8986;&#x76D6;&#x6574;&#x4E2A;32&#x4F4D;&#x5730;&#x5740;&#x7A7A;&#x95F4;&#x7684;&#x4E00;&#x4E2A;&#x6574;&#x6BB5;&#x3002;&#x7531;&#x4E8E;&#x57FA;&#x5730;&#x5740;&#x4E3A;0&#xFF0C;&#x6B64;&#x65F6;&#x7684;&#x7269;&#x7406;&#x5730;&#x5740;&#x4E0E;&#x903B;&#x8F91;&#x5730;&#x5740;&#x76F8;&#x540C;&#xFF0C;CPU&#x653E;&#x5230;&#x5730;&#x5740;&#x603B;&#x7EBF;&#x4E0A;&#x53BB;&#x7684;&#x5730;&#x5740;&#x5C31;&#x662F;&#x5728;&#x6307;&#x4EE4;&#x4E2D;&#x7ED9;&#x51FA;&#x7684;&#x5730;&#x5740;&#x3002;&#x8FD9;&#x6837;&#x7684;&#x5730;&#x5740;&#x6709;&#x522B;&#x4E8E;&#x7531;&#x201C;&#x6BB5;&#x5BC4;&#x5B58;&#x5668;/&#x4F4D;&#x79FB;&#x91CF;&#x201D;&#x6784;&#x6210;&#x7684;&#x5C42;&#x6B21;&#x5F0F;&#x5730;&#x5740;&#xFF0C;&#x6240;&#x4EE5;Intel&#x79F0;&#x5176;&#x4E3A;&#x5E73;&#x9762;&#x5730;&#x5740;&#x3002;</p>
<p>&#x5229;&#x7528;80386&#x5BF9;&#x6BB5;&#x5F0F;&#x5185;&#x5B58;&#x7BA1;&#x7406;&#x7684;&#x786C;&#x4EF6;&#x652F;&#x6301;&#xFF0C;&#x53EF;&#x4EE5;&#x5B9E;&#x73B0;&#x6BB5;&#x5F0F;&#x865A;&#x5B58;&#x7BA1;&#x7406;&#x3002;&#x5F53;&#x4E00;&#x4E2A;&#x6BB5;&#x5BC4;&#x5B58;&#x5668;&#x7684;&#x5185;&#x5BB9;&#x6539;&#x53D8;&#x65F6;&#xFF0C;CPU&#x8981;&#x6839;&#x636E;&#x65B0;&#x7684;&#x6BB5;&#x5BC4;&#x5B58;&#x5668;&#x5185;&#x5B58;&#x4EE5;&#x53CA;GDTR&#x6216;LDTR&#x7684;&#x5185;&#x5BB9;&#x627E;&#x5230;&#x76F8;&#x5E94;&#x7684;&#x6BB5;&#x63CF;&#x8FF0;&#x9879;&#x5E76;&#x5C06;&#x5176;&#x88C5;&#x5165;CPU&#x4E2D;&#x3002;&#x5728;&#x6B64;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;CPU&#x4F1A;&#x68C0;&#x67E5;&#x8BE5;&#x63CF;&#x8FF0;&#x9879;&#x4E2D;&#x7684;p&#x6807;&#x5FD7;&#x4F4D;&#xFF0C;&#x5982;&#x679C;p&#x6807;&#x5FD7;&#x4E3A;0&#xFF0C;&#x5C31;&#x8868;&#x793A;&#x8BE5;&#x63CF;&#x8FF0;&#x9879;&#x6240;&#x6307;&#x5411;&#x7684;&#x90A3;&#x4E00;&#x6BB5;&#x5185;&#x5BB9;&#x4E0D;&#x5728;&#x5185;&#x5B58;&#x4E2D;&#xFF08;&#x5728;&#x78C1;&#x76D8;&#x4E0A;&#x7684;&#x67D0;&#x4E2A;&#x5730;&#x65B9;&#xFF09;&#xFF0C;&#x6B64;&#x65F6;CPU&#x4F1A;&#x4EA7;&#x751F;&#x4E00;&#x6B21;&#x5F02;&#x5E38;&#xFF0C;&#x800C;&#x76F8;&#x5E94;&#x7684;&#x670D;&#x52A1;&#x7A0B;&#x5E8F;&#x4FBF;&#x53EF;&#x4EE5;&#x4ECE;&#x78C1;&#x76D8;&#x4EA4;&#x6362;&#x533A;&#x5C06;&#x8FD9;&#x4E00;&#x6BB5;&#x7684;&#x5185;&#x5BB9;&#x8BFB;&#x5165;&#x5185;&#x5B58;&#x4E2D;&#x7684;&#x67D0;&#x4E2A;&#x5730;&#x65B9;&#xFF0C;&#x5E76;&#x636E;&#x6B64;&#x8BBE;&#x7F6E;&#x63CF;&#x8FF0;&#x9879;&#x4E2D;&#x7684;&#x57FA;&#x5730;&#x5740;&#xFF0C;&#x518D;&#x5C06;p&#x6807;&#x5FD7;&#x4F4D;&#x8BBE;&#x7F6E;&#x6210;1&#x3002;&#x76F8;&#x5E94;&#x5730;&#xFF0C;&#x5185;&#x5B58;&#x4E2D;&#x6682;&#x65F6;&#x4E0D;&#x7528;&#x7684;&#x5B58;&#x50A8;&#x6BB5;&#x5219;&#x53EF;&#x4EE5;&#x5199;&#x5165;&#x78C1;&#x76D8;&#xFF0C;&#x5E76;&#x5C06;&#x5176;&#x63CF;&#x8FF0;&#x9879;&#x4E2D;p&#x6807;&#x5FD7;&#x4F4D;&#x6539;&#x4E3A;0&#x3002;</p>
<p>&#x5BF9;&#x6BB5;&#x5F0F;&#x5185;&#x5B58;&#x7BA1;&#x7406;&#x7684;&#x652F;&#x6301;&#x53EA;&#x662F;i386&#x4FDD;&#x62A4;&#x6A21;&#x5F0F;&#x7684;&#x4E00;&#x4E2A;&#x7EC4;&#x6210;&#x90E8;&#x5206;&#xFF0C;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x7CFB;&#x7EDF;&#x72B6;&#x6001;&#x548C;&#x7528;&#x6237;&#x72B6;&#x6001;&#x7684;&#x5206;&#x79BB;&#xFF0C;&#x4EE5;&#x53CA;&#x7279;&#x6743;&#x6307;&#x4EE4;&#xFF08;&#x53EA;&#x5141;&#x8BB8;&#x5728;&#x7CFB;&#x7EDF;&#x72B6;&#x6001;&#x4E0B;&#x4F7F;&#x7528;&#xFF09;&#x7684;&#x8BBE;&#x7ACB;&#xFF0C;&#x90A3;&#x4E48;&#x5C3D;&#x7BA1;&#x6709;&#x4E86;&#x6BB5;&#x5F0F;&#x5185;&#x5B58;&#x7BA1;&#x7406;&#xFF0C;&#x4E5F;&#x4E0D;&#x80FD;&#x8D77;&#x5230;&#x4FDD;&#x62A4;&#x7684;&#x6548;&#x679C;
80386&#x5C06;&#x6267;&#x884C;&#x6743;&#x9650;&#x5212;&#x5206;4&#x4E2A;&#x7279;&#x6743;&#x7EA7;&#x522B;&#xFF0C;&#x5176;&#x4E2D;0&#x7EA7;&#x6700;&#x9AD8;&#xFF0C;3&#x7EA7;&#x6700;&#x4F4E;&#x3002;&#x6BCF;&#x4E00;&#x6761;&#x6307;&#x4EE4;&#x4E5F;&#x90FD;&#x6709;&#x5176;&#x9002;&#x7528;&#x754C;&#x522B;&#x3002;&#x4E00;&#x822C;&#x7A0B;&#x5E8F;&#x7684;&#x5F53;&#x524D;&#x8FD0;&#x884C;&#x7EA7;&#x522B;&#x7531;&#x5176;&#x4EE3;&#x7801;&#x6BB5;&#x7684;&#x5C40;&#x90E8;&#x63CF;&#x8FF0;&#x9879;&#x4E2D;&#x7684;dpl&#x5B57;&#x6BB5;&#x51B3;&#x5B9A;&#x3002;&#x6BCF;&#x4E2A;&#x63CF;&#x8FF0;&#x9879;&#x4E2D;&#x7684;dpl&#x5B57;&#x6BB5;&#x90FD;&#x662F;&#x5728;0&#x7EA7;&#x72B6;&#x6001;&#x4E0B;&#x7531;&#x5185;&#x6838;&#x8BBE;&#x5B9A;&#x7684;&#x3002;&#x800C;&#x5168;&#x5C40;&#x6BB5;&#x63CF;&#x8FF0;&#x7684;dpl&#x5B57;&#x6BB5;&#xFF0C;&#x8868;&#x793A;&#x6240;&#x9700;&#x7684;&#x7EA7;&#x522B;&#x3002;&#x5F53;&#x6539;&#x53D8;&#x4E00;&#x4E2A;&#x6BB5;&#x5BC4;&#x5B58;&#x5668;&#x7684;&#x5185;&#x5BB9;&#x65F6;&#xFF0C;CPU&#x4F1A;&#x52A0;&#x4EE5;&#x68C0;&#x67E5;&#xFF0C;&#x4EE5;&#x786E;&#x4FDD;&#x8BE5;&#x6BB5;&#x7A0B;&#x5E8F;&#x7684;&#x5F53;&#x524D;&#x6267;&#x884C;&#x6743;&#x9650;&#x548C;&#x6BB5;&#x5BC4;&#x5B58;&#x5668;&#x6240;&#x6307;&#x5B9A;&#x8981;&#x6C42;&#x7684;&#x6743;&#x9650;&#x5747;&#x4E0D;&#x4F4E;&#x4E8E;&#x6240;&#x8981;&#x8BBF;&#x95EE;&#x7684;&#x90A3;&#x4E00;&#x6BB5;&#x5185;&#x5B58;&#x7684;&#x6743;&#x9650;dpl&#x3002;</p>
<p>&#x6BB5;&#x63CF;&#x8FF0;&#x7B26;&#x8868;&#xFF1A;IA-32&#x5904;&#x7406;&#x5668;&#x628A;&#x6240;&#x6709;&#x6BB5;&#x63CF;&#x8FF0;&#x7B26;&#x6309;&#x987A;&#x5E8F;&#x7EC4;&#x7EC7;&#x6210;&#x7EBF;&#x6027;&#x8868; &#x653E;&#x5728;&#x5185;&#x5B58;&#x4E2D;&#xFF0C;&#x79F0;&#x4E3A;&#x6BB5;&#x63CF;&#x8FF0;&#x7B26;&#x8868;&#x3002;&#x5206;&#x4E3A;&#x4E09;&#x7C7B;&#xFF1A;&#x5168;&#x5C40;&#x63CF;&#x8FF0;&#x7B26;&#x8868;GDT&#xFF0C;&#x5C40;&#x90E8;&#x63CF;&#x8FF0;&#x7B26;&#x8868;LDT&#x548C;&#x4E2D;&#x65AD;&#x63CF;&#x8FF0;&#x7B26;&#x8868;IDT&#x3002;GDT&#x548C;IDT&#x5728;&#x6574;&#x4E2A;&#x7CFB;&#x7EDF;&#x4E2D;&#x53EA;&#x6709;&#x4E00;&#x5F20;&#xFF0C;&#x800C;&#x6BCF;&#x4E2A;&#x4EFB;&#x52A1; &#x90FD;&#x6709;&#x81EA;&#x5DF1;&#x79C1;&#x6709;&#x7684;&#x4E00;&#x5F20;&#x5C40;&#x90E8;&#x63CF;&#x8FF0;&#x7B26;&#x8868;LDT&#xFF0C;&#x7528;&#x4E8E;&#x8BB0;&#x5F55;&#x672C;&#x4EFB;&#x52A1;&#x4E2D;&#x6D89;&#x53CA;&#x7684;&#x5404;&#x4E2A;&#x4EE3;&#x7801;&#x6BB5;&#x3001;&#x6570;&#x636E;&#x6BB5;&#x548C;&#x5806;&#x6808;&#x6BB5;&#x4EE5;&#x53CA;&#x672C;&#x4EFB;&#x52A1;&#x7684;&#x4F7F;&#x7528;&#x7684;&#x95E8;&#x63CF;&#x8FF0;&#x7B26;&#x3002;GDT&#x5305;&#x542B;&#x7CFB;&#x7EDF;&#x4F7F;&#x7528;&#x7684;&#x4EE3;&#x7801;&#x6BB5;&#x3001;&#x6570; &#x636E;&#x6BB5;&#x3001;&#x5806;&#x6808;&#x6BB5;&#x548C;&#x7279;&#x6B8A;&#x6570;&#x636E;&#x6BB5;&#x63CF;&#x8FF0;&#x7B26;&#xFF0C;&#x4EE5;&#x53CA;&#x6240;&#x6709;&#x4EFB;&#x52A1;&#x5C40;&#x90E8;&#x63CF;&#x8FF0;&#x7B26;&#x8868;LDT&#x7684;&#x63CF;&#x8FF0;&#x7B26;&#x3002;GDT&#xFF0C;LDT&#x4E3A;&#x5185;&#x5B58;&#x4E2D;&#x7684;&#x4E00;&#x4E2A;&#x7ED3;&#x6784;&#x6570;&#x7EC4;&#x3002;&#x6BB5;&#x63CF;&#x8FF0;&#x7B26;&#x662F;&#x4E00;&#x4E2A;&#x7ED3;&#x6784;&#xFF0C;&#x5373;&#x6570;&#x7EC4;&#x4E2D;&#x7684;&#x5143;&#x7D20;&#x3002;</p>
<p><img src="Users/zhangenshang/Desktop/&#x5927;&#x4F5C;&#x4E1A;&#x7AE0;&#x8282;/Chapter7/20181221173315896.png" alt="20181221173315896"></p>
<h2 id="73-hello&#x7684;&#x7EBF;&#x6027;&#x5730;&#x5740;&#x5230;&#x7269;&#x7406;&#x5730;&#x5740;&#x7684;&#x53D8;&#x6362;&#x9875;&#x5F0F;&#x7BA1;&#x7406;">7.3 Hello&#x7684;&#x7EBF;&#x6027;&#x5730;&#x5740;&#x5230;&#x7269;&#x7406;&#x5730;&#x5740;&#x7684;&#x53D8;&#x6362;-&#x9875;&#x5F0F;&#x7BA1;&#x7406;</h2>
<p>VM&#x7CFB;&#x7EDF;&#x901A;&#x8FC7;&#x5C06;&#x865A;&#x62DF;&#x5185;&#x5B58;&#x5206;&#x5272;&#x79F0;&#x4E3A;<strong>&#x865A;&#x62DF;&#x9875;</strong>&#x7684;&#x5927;&#x5C0F;&#x56FA;&#x5B9A;&#x7684;&#x5757;&#x6765;&#x5904;&#x7406;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x3002;&#x6BCF;&#x4E2A;&#x865A;&#x62DF;&#x9875;&#x7684;&#x5927;&#x5C0F;&#x4E3A;P = 2^p&#x5B57;&#x8282;&#x3002;&#x7C7B;&#x4F3C;&#x5730;&#xFF0C;&#x7269;&#x7406;&#x5185;&#x5B58;&#x88AB;&#x5206;&#x5272;&#x4E3A;<strong>&#x7269;&#x7406;&#x9875;</strong>&#xFF0C;&#x5927;&#x5C0F;&#x4E5F;&#x4E3A;P&#x5B57;&#x8282;&#xFF0C;&#x7269;&#x7406;&#x9875;&#x4E5F;&#x88AB;&#x79F0;&#x4E3A;<strong>&#x9875;&#x5E27;</strong>&#x3002;</p>
<p><img src="Users/zhangenshang/Desktop/&#x5927;&#x4F5C;&#x4E1A;&#x7AE0;&#x8282;/Chapter7/&#x5C4F;&#x5E55;&#x5FEB;&#x7167; 2018-12-27 &#x4E0B;&#x5348;8.34.58.png" alt="&#x5C4F;&#x5E55;&#x5FEB;&#x7167; 2018-12-27 &#x4E0B;&#x5348;8.34.58"></p>
<p>&#x540C;&#x4EFB;&#x4F55;&#x7F13;&#x5B58;&#x4E00;&#x6837;&#xFF0C;&#x865A;&#x62DF;&#x5185;&#x5B58;&#x7CFB;&#x7EDF;&#x5FC5;&#x987B;&#x6709;&#x67D0;&#x79CD;&#x65B9;&#x6CD5;&#x6765;&#x5224;&#x5B9A;&#x4E00;&#x4E2A;&#x865A;&#x62DF;&#x9875;&#x662F;&#x5426;&#x7F13;&#x5B58;&#x5728;DRAM&#x7684;&#x67D0;&#x4E00;&#x4E2A;&#x5730;&#x65B9;&#x3002;&#x5982;&#x679C;&#x662F;&#xFF0C;&#x90A3;&#x4E48;&#x7CFB;&#x7EDF;&#x8FD8;&#x5FC5;&#x987B;&#x5224;&#x65AD;&#x8FD9;&#x4E2A;&#x865A;&#x62DF;&#x9875;&#x5B58;&#x653E;&#x5728;&#x78C1;&#x76D8;&#x7684;&#x54EA;&#x4E2A;&#x4F4D;&#x7F6E;&#xFF0C;&#x5728;&#x7269;&#x7406;&#x5185;&#x5B58;&#x4E2D;&#x9009;&#x62E9;&#x4E00;&#x4E2A;&#x727A;&#x7272;&#x9875;&#xFF0C;&#x5E76;&#x5C06;&#x865A;&#x62DF;&#x9875;&#x4ECE;&#x78C1;&#x76D8;&#x4E2D;&#x590D;&#x5236;&#x5230;DRAM&#x4E2D;&#x66FF;&#x6362;&#x8FD9;&#x4E2A;&#x727A;&#x7272;&#x9875;&#x3002;</p>
<p>&#x8FD9;&#x4E9B;&#x529F;&#x80FD;&#x662F;&#x7531;&#x8F6F;&#x786C;&#x4EF6;&#x8054;&#x5408;&#x63D0;&#x4F9B;&#x7684;&#xFF0C;&#x5305;&#x62EC;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x8F6F;&#x4EF6;&#x3001;MMU&#x4E2D;&#x7684;&#x5730;&#x5740;&#x7FFB;&#x8BD1;&#x786C;&#x4EF6;&#x548C;&#x4E00;&#x4E2A;&#x5B58;&#x653E;&#x5728;&#x7269;&#x7406;&#x5185;&#x5B58;&#x4E2D;&#x53EB;&#x505A;<strong>&#x9875;&#x8868;</strong>&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#xFF0C;&#x9875;&#x8868;&#x5C06;&#x865A;&#x62DF;&#x9875;&#x6620;&#x5C04;&#x5230;&#x7269;&#x7406;&#x9875;&#x3002;&#x6BCF;&#x6B21;&#x5730;&#x5740;&#x7FFB;&#x8BD1;&#x786C;&#x4EF6;&#x5C06;&#x4E00;&#x4E2A;&#x865A;&#x62DF;&#x5730;&#x5740;&#x8F6C;&#x6362;&#x4E3A;&#x7269;&#x7406;&#x5730;&#x5740;&#x65F6;&#xFF0C;&#x90FD;&#x4F1A;&#x8BFB;&#x53D6;&#x9875;&#x8868;&#x3002;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x8D1F;&#x8D23;&#x7EF4;&#x62A4;&#x9875;&#x8868;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x4EE5;&#x53CA;&#x5728;&#x78C1;&#x76D8;&#x548C;DRAM&#x4E4B;&#x95F4;&#x6765;&#x56DE;&#x4F20;&#x9001;&#x9875;&#x3002;&#x9875;&#x8868;&#x662F;&#x4E00;&#x4E2A;<strong>&#x9875;&#x8868;&#x6761;&#x76EE;</strong>&#xFF08;PTE&#xFF09;&#x7684;&#x6570;&#x7EC4;&#x3002;&#x865A;&#x62DF;&#x5730;&#x5740;&#x7A7A;&#x95F4;&#x4E2D;&#x7684;&#x6BCF;&#x4E2A;&#x9875;&#x5728;&#x9875;&#x8868;&#x4E2D;&#x4E00;&#x4E2A;&#x56FA;&#x5B9A;&#x504F;&#x79FB;&#x91CF;&#x5904;&#x90FD;&#x6709;&#x4E00;&#x4E2A;PTE&#x3002;&#x4E3A;&#x4E86;&#x6211;&#x4EEC;&#x7684;&#x76EE;&#x7684;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x5047;&#x8BBE;&#x6BCF;&#x4E2A;PTE&#x662F;&#x7531;&#x4E00;&#x4E2A;<strong>&#x6709;&#x6548;&#x4F4D;</strong>&#x548C;n&#x4F4D;&#x5730;&#x5740;&#x5B57;&#x6BB5;&#x7EC4;&#x6210;&#x7684;&#x3002;&#x6709;&#x6548;&#x4F4D;&#x8868;&#x660E;&#x4E86;&#x8BE5;&#x865A;&#x62DF;&#x9875;&#x5F53;&#x524D;&#x662F;&#x5426;&#x88AB;&#x7F13;&#x5B58;&#x5728;DRAM&#x4E2D;&#x3002;&#x5982;&#x679C;&#x8BBE;&#x7F6E;&#x4E86;&#x6709;&#x6548;&#x4F4D;&#xFF0C;&#x90A3;&#x4E48;&#x5730;&#x5740;&#x5B57;&#x6BB5;&#x5C31;&#x8868;&#x793A;DRAM&#x4E2D;&#x76F8;&#x5E94;&#x7684;&#x7269;&#x7406;&#x9875;&#x7684;&#x8D77;&#x59CB;&#x4F4D;&#x7F6E;&#xFF0C;&#x8FD9;&#x4E2A;&#x7269;&#x7406;&#x9875;&#x4E2D;&#x7F13;&#x5B58;&#x4E86;&#x8BE5;&#x865A;&#x62DF;&#x9875;&#x3002;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x8BBE;&#x7F6E;&#x6709;&#x6548;&#x4F4D;&#xFF0C;&#x90A3;&#x4E48;&#x4E00;&#x4E2A;&#x7A7A;&#x5730;&#x5740;&#x8868;&#x793A;&#x8FD9;&#x4E2A;&#x865A;&#x62DF;&#x9875;&#x8FD8;&#x672A;&#x88AB;&#x5206;&#x914D;&#x3002;&#x5426;&#x5219;&#xFF0C;&#x8FD9;&#x4E2A;&#x5730;&#x5740;&#x5C31;&#x6307;&#x5411;&#x8BE5;&#x865A;&#x62DF;&#x9875;&#x5728;&#x78C1;&#x76D8;&#x4E0A;&#x7684;&#x521D;&#x59CB;&#x4F4D;&#x7F6E;&#x3002;</p>
<p><img src="Users/zhangenshang/Desktop/&#x5927;&#x4F5C;&#x4E1A;&#x7AE0;&#x8282;/Chapter7/&#x5C4F;&#x5E55;&#x5FEB;&#x7167; 2018-12-27 &#x4E0B;&#x5348;8.44.32.png" alt="&#x5C4F;&#x5E55;&#x5FEB;&#x7167; 2018-12-27 &#x4E0B;&#x5348;8.44.32"></p>
<p><img src="Users/zhangenshang/Desktop/&#x5927;&#x4F5C;&#x4E1A;&#x7AE0;&#x8282;/Chapter7/&#x5C4F;&#x5E55;&#x5FEB;&#x7167; 2018-12-28 &#x4E0B;&#x5348;6.22.02.png" alt="&#x5C4F;&#x5E55;&#x5FEB;&#x7167; 2018-12-28 &#x4E0B;&#x5348;6.22.02"></p>
<p>&#x6240;&#x8C13;&#x7EBF;&#x6027;&#x5730;&#x5740;&#x5230;&#x7269;&#x7406;&#x5730;&#x5740;&#x7684;&#x8F6C;&#x6362;&#x8FC7;&#x7A0B;&#x5C31;&#x662F;&#x5730;&#x5740;&#x7FFB;&#x8BD1;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x5F62;&#x5F0F;&#x4E0A;&#x6765;&#x8BF4;&#xFF0C;&#x5730;&#x5740;&#x7FFB;&#x8BD1;&#x662F;&#x4E00;&#x4E2A;N&#x5143;&#x7D20;&#x7684;&#x865A;&#x62DF;&#x5730;&#x5740;&#x7A7A;&#x95F4;&#xFF08;VAS&#xFF09;&#x4E2D;&#x7684;&#x5143;&#x7D20;&#x548C;&#x4E00;&#x4E2A;M&#x5143;&#x7D20;&#x7684;&#x7269;&#x7406;&#x5730;&#x5740;&#x7A7A;&#x95F4;&#xFF08;PAS&#xFF09;&#x4E2D;&#x5143;&#x7D20;&#x4E4B;&#x95F4;&#x7684;&#x6620;&#x5C04;&#x3002;<img src="Users/zhangenshang/Desktop/&#x5927;&#x4F5C;&#x4E1A;&#x7AE0;&#x8282;/Chapter7/&#x5C4F;&#x5E55;&#x5FEB;&#x7167; 2018-12-28 &#x4E0B;&#x5348;6.25.06.png" alt="&#x5C4F;&#x5E55;&#x5FEB;&#x7167; 2018-12-28 &#x4E0B;&#x5348;6.25.06"></p>
<p>CPU&#x4E2D;&#x7684;&#x4E00;&#x4E2A;&#x63A7;&#x5236;&#x5BC4;&#x5B58;&#x5668;&#xFF0C;<strong>&#x9875;&#x8868;&#x57FA;&#x5740;&#x5BC4;&#x5B58;&#x5668;</strong>&#xFF08;PTBR&#xFF09;&#x6307;&#x5411;&#x5F53;&#x524D;&#x9875;&#x8868;&#x3002;n&#x4F4D;&#x7684;&#x865A;&#x62DF;&#x5730;&#x5740;&#x5305;&#x542B;&#x4E24;&#x4E2A;&#x90E8;&#x5206;&#xFF1A;&#x4E00;&#x4E2A;p&#x4F4D;&#x7684;<strong>&#x865A;&#x62DF;&#x9875;&#x9762;&#x504F;&#x79FB;</strong>&#xFF08;VPO&#xFF09;&#x548C;&#x4E00;&#x4E2A;&#xFF08;n-p&#xFF09;&#x4F4D;&#x7684;<strong>&#x865A;&#x62DF;&#x9875;&#x53F7;</strong>&#xFF08;VPN&#xFF09;&#x3002;<strong>&#x865A;&#x62DF;&#x5185;&#x5B58;&#x5355;&#x5143;</strong>&#xFF08;MMU&#xFF09;&#x5229;&#x7528;VPN&#x6765;&#x9009;&#x62E9;&#x9002;&#x5F53;&#x7684;PTE&#x3002;&#x5C06;&#x9875;&#x8868;&#x6761;&#x76EE;&#x4E2D;<strong>&#x7269;&#x7406;&#x9875;&#x53F7;</strong>&#xFF08;PPN&#xFF09;&#x548C;&#x865A;&#x62DF;&#x5730;&#x5740;&#x7684;VPO&#x4E32;&#x8054;&#x8D77;&#x6765;&#xFF0C;&#x5C31;&#x5F97;&#x5230;&#x76F8;&#x5E94;&#x7684;&#x7269;&#x7406;&#x5730;&#x5740;&#x3002;&#x6CE8;&#x610F;&#xFF0C;&#x56E0;&#x4E3A;&#x7269;&#x7406;&#x548C;&#x865A;&#x62DF;&#x9875;&#x9762;&#x90FD;&#x662F;P&#x5B57;&#x8282;&#x7684;&#xFF0C;&#x6240;&#x4EE5;<strong>&#x7269;&#x7406;&#x9875;&#x9762;&#x504F;&#x79FB;</strong>&#xFF08;PPO&#xFF09;&#x548C;VPO&#x662F;&#x76F8;&#x540C;&#x7684;&#x3002;<img src="Users/zhangenshang/Desktop/&#x5927;&#x4F5C;&#x4E1A;&#x7AE0;&#x8282;/Chapter7/&#x5C4F;&#x5E55;&#x5FEB;&#x7167; 2018-12-28 &#x4E0B;&#x5348;6.32.01.png" alt="&#x5C4F;&#x5E55;&#x5FEB;&#x7167; 2018-12-28 &#x4E0B;&#x5348;6.32.01"></p>
<h2 id="74-tlb&#x4E0E;&#x56DB;&#x7EA7;&#x9875;&#x8868;&#x652F;&#x6301;&#x4E0B;&#x7684;va&#x5230;pa&#x7684;&#x53D8;&#x6362;">7.4 TLB&#x4E0E;&#x56DB;&#x7EA7;&#x9875;&#x8868;&#x652F;&#x6301;&#x4E0B;&#x7684;VA&#x5230;PA&#x7684;&#x53D8;&#x6362;</h2>
<p>&#x6BCF;&#x6B21;CPU&#x4EA7;&#x751F;&#x4E00;&#x4E2A;&#x865A;&#x62DF;&#x5730;&#x5740;&#xFF0C;MMU&#x5C31;&#x5FC5;&#x987B;&#x67E5;&#x9605;&#x4E00;&#x4E2A;PTE&#xFF0C;&#x4EE5;&#x4FBF;&#x6211;&#x4EEC;&#x5C06;&#x865A;&#x62DF;&#x5730;&#x5740;&#x7FFB;&#x8BD1;&#x4E3A;&#x7269;&#x7406;&#x5730;&#x5740;&#x3002;&#x5728;&#x6700;&#x7CDF;&#x7CD5;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x8FD9;&#x4F1A;&#x8981;&#x6C42;&#x4ECE;&#x5185;&#x5B58;&#x4E2D;&#x591A;&#x53D6;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#xFF0C;&#x4EE3;&#x4EF7;&#x662F;&#x51E0;&#x5341;&#x5230;&#x51E0;&#x767E;&#x4E2A;&#x5468;&#x671F;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x8BB8;&#x591A;&#x7CFB;&#x7EDF;&#x90FD;&#x8BD5;&#x56FE;&#x53BB;&#x6D88;&#x9664;&#x8FD9;&#x6837;&#x7684;&#x5F00;&#x9500;&#xFF0C;&#x5B83;&#x4EEC;&#x5728;MMU&#x4E2D;&#x5305;&#x62EC;&#x4E86;&#x4E00;&#x4E2A;&#x5173;&#x4E8E;PTE&#x7684;&#x5C0F;&#x7684;&#x7F13;&#x5B58;&#xFF0C;&#x79F0;&#x4E3A;<strong>&#x7FFB;&#x8BD1;&#x540E;&#x5907;&#x7F13;&#x51B2;&#x5668;</strong>&#xFF08;TLB&#xFF09;&#x3002;TLB&#x662F;&#x4E00;&#x4E2A;&#x5C0F;&#x7684;&#x3001;&#x865A;&#x62DF;&#x5BFB;&#x5740;&#x7684;&#x7F13;&#x5B58;&#xFF0C;&#x5176;&#x4E2D;&#x6BCF;&#x4E00;&#x884C;&#x90FD;&#x4FDD;&#x5B58;&#x7740;&#x4E00;&#x4E2A;&#x7531;&#x5355;&#x4E2A;PTE&#x7EC4;&#x6210;&#x7684;&#x5757;&#xFF0C;TLB&#x901A;&#x5E38;&#x6709;&#x9AD8;&#x5EA6;&#x7684;&#x76F8;&#x8054;&#x5EA6;&#x3002;&#x7528;&#x4E8E;&#x7EC4;&#x9009;&#x62E9;&#x548C;&#x884C;&#x5339;&#x914D;&#x7684;&#x7D22;&#x5F15;&#x548C;&#x6807;&#x8BB0;&#x5B57;&#x6BB5;&#x662F;&#x4ECE;&#x865A;&#x62DF;&#x5730;&#x5740;&#x7684;&#x865A;&#x62DF;&#x9875;&#x53F7;&#x4E2D;&#x63D0;&#x53D6;&#x51FA;&#x6765;&#x7684;&#x3002;&#x5982;&#x679C;&#x8BF4;TLB&#x6709;T = 2 ^ t&#x4E2A;&#x7EC4;&#xFF0C;&#x90A3;&#x4E48;<strong>TLB&#x7D22;&#x5F15;</strong>&#xFF08;TLBI&#xFF09;&#x662F;&#x7531;VPN&#x7684;t&#x4E2A;&#x6700;&#x4F4E;&#x4F4D;&#x7EC4;&#x6210;&#x7684;&#xFF0C;&#x800C;<strong>TLB&#x6807;&#x8BB0;</strong>&#xFF08;TLBT&#xFF09;&#x662F;&#x7531;VPN&#x4E2D;&#x5269;&#x4F59;&#x7684;&#x4F4D;&#x7EC4;&#x6210;&#x7684;&#x3002;</p>
<p><img src="Users/zhangenshang/Desktop/&#x5927;&#x4F5C;&#x4E1A;&#x7AE0;&#x8282;/Chapter7/&#x5C4F;&#x5E55;&#x5FEB;&#x7167; 2018-12-28 &#x4E0B;&#x5348;7.11.54.png" alt="&#x5C4F;&#x5E55;&#x5FEB;&#x7167; 2018-12-28 &#x4E0B;&#x5348;7.11.54"></p>
<p><img src="Users/zhangenshang/Desktop/&#x5927;&#x4F5C;&#x4E1A;&#x7AE0;&#x8282;/Chapter7/&#x5C4F;&#x5E55;&#x5FEB;&#x7167; 2018-12-28 &#x4E0B;&#x5348;7.11.40.png" alt="&#x5C4F;&#x5E55;&#x5FEB;&#x7167; 2018-12-28 &#x4E0B;&#x5348;7.11.40"></p>
<p>&#x5BF9;&#x4E8E;&#x4F7F;&#x7528;k&#x7EA7;&#x9875;&#x8868;&#x5C42;&#x6B21;&#x7ED3;&#x6784;&#x7684;&#x5730;&#x5740;&#x7FFB;&#x8BD1;&#xFF0C;&#x865A;&#x62DF;&#x5730;&#x5740;&#x88AB;&#x5212;&#x5206;&#x6210;k&#x4E2A;VPN&#x548C;1&#x4E2A;VPO&#x3002;&#x6BCF;&#x4E2A;VPN i &#x90FD;&#x662F;&#x4E00;&#x4E2A;&#x5230;&#x7B2C; i &#x7EA7;&#x9875;&#x8868;&#x7684;&#x7D22;&#x5F15;&#xFF0C;&#x5176;&#x4E2D;1 &lt;= i &lt;= k&#x3002;&#x7B2C; j &#x7EA7;&#x9875;&#x8868;&#x4E2D;&#x7684;&#x6BCF;&#x4E00;&#x4E2A;PTE&#xFF0C;1 &lt;= j &lt;= k-1&#xFF0C;&#x90FD;&#x6307;&#x5411;j+1&#x7EA7;&#x7684;&#x67D0;&#x4E2A;&#x9875;&#x8868;&#x7684;&#x57FA;&#x5740;&#x3002;&#x7B2C;k&#x7EA7;&#x9875;&#x8868;&#x4E2D;&#x7684;&#x6BCF;&#x4E00;&#x4E2A;PTE&#x5305;&#x542B;&#x67D0;&#x4E2A;&#x7269;&#x7406;&#x9875;&#x9762;&#x7684;PPN&#xFF0C;&#x6216;&#x8005;&#x4E00;&#x4E2A;&#x78C1;&#x76D8;&#x5757;&#x7684;&#x5730;&#x5740;&#x3002;&#x4E3A;&#x4E86;&#x6784;&#x9020;&#x7269;&#x7406;&#x5730;&#x5740;&#xFF0C;&#x5728;&#x80FD;&#x591F;&#x786E;&#x5B9A; PPN&#x4E4B;&#x524D;&#xFF0C;MMU&#x5FC5;&#x987B;&#x8BBF;&#x95EE;k&#x4E2A;PTE&#x3002;&#x5BF9;&#x4E8E;&#x53EA;&#x6709;&#x4E00;&#x7EA7;&#x7684;&#x9875;&#x8868;&#x7ED3;&#x6784;&#xFF0C;PPO&#x548C;VPO&#x662F;&#x76F8;&#x540C;&#x7684;&#x3002;</p>
<p><img src="Users/zhangenshang/Desktop/&#x5927;&#x4F5C;&#x4E1A;&#x7AE0;&#x8282;/Chapter7/&#x5C4F;&#x5E55;&#x5FEB;&#x7167; 2018-12-28 &#x4E0B;&#x5348;7.12.09.png" alt="&#x5C4F;&#x5E55;&#x5FEB;&#x7167; 2018-12-28 &#x4E0B;&#x5348;7.12.09"></p>
<p>&#x5728;&#x8FD9;&#x91CC;&#xFF0C;&#x6559;&#x6750;&#x4E0A;&#x4F7F;&#x7528;&#x7684;&#x662F;&#x4E00;&#x4E2A;&#x8FD0;&#x884C;Linux&#x7684;Intel Core i7&#x3002;Core i7&#x5B9E;&#x73B0;&#x652F;&#x6301;48&#x4F4D;&#xFF08;256TB&#xFF09;&#x865A;&#x62DF;&#x5730;&#x5740;&#x7A7A;&#x95F4;&#x548C;52&#x4F4D;&#xFF08;4PB&#xFF09;&#x7269;&#x7406;&#x5730;&#x5740;&#x7A7A;&#x95F4;&#xFF0C;&#x8FD8;&#x6709;&#x4E00;&#x4E2A;&#x517C;&#x5BB9;&#x6A21;&#x5F0F;&#xFF0C;&#x652F;&#x6301;32&#x4F4D;&#xFF08;4GB&#xFF09;&#x865A;&#x62DF;&#x548C;&#x7269;&#x7406;&#x5730;&#x5740;&#x7A7A;&#x95F4;&#x3002;Core i7&#x91C7;&#x7528;&#x56DB;&#x7EA7;&#x9875;&#x8868;&#x5C42;&#x6B21;&#x7ED3;&#x6784;&#x3002;&#x6BCF;&#x4E2A;&#x8FDB;&#x7A0B;&#x6709;&#x5B83;&#x81EA;&#x5DF1;&#x79C1;&#x6709;&#x7684;&#x9875;&#x8868;&#x5C42;&#x6B21;&#x7ED3;&#x6784;&#x3002;&#x5F53;&#x4E00;&#x4E2A;Linux&#x8FDB;&#x7A0B;&#x8FD0;&#x884C;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x867D;&#x7136;Core i7&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#x5141;&#x8BB8;&#x9875;&#x8868;&#x6362;&#x8FDB;&#x6362;&#x51FA;&#xFF0C;&#x4F46;&#x662F;&#x4E0E;&#x5DF2;&#x5206;&#x914D;&#x4E86;&#x7684;&#x9875;&#x76F8;&#x5173;&#x8054;&#x7684;&#x9875;&#x8868;&#x90FD;&#x662F;&#x9A7B;&#x7559;&#x5728;&#x5185;&#x5B58;&#x4E2D;&#x7684;&#x3002;CR3&#x63A7;&#x5236;&#x5BC4;&#x5B58;&#x5668;&#x6307;&#x5411;&#x7B2C;&#x4E00;&#x7EA7;&#x9875;&#x8868;&#xFF08;L1&#xFF09;&#x7684;&#x8D77;&#x59CB;&#x4F4D;&#x7F6E;&#x3002;CR3&#x7684;&#x503C;&#x662F;&#x6BCF;&#x4E2A;&#x8FDB;&#x7A0B;&#x4E0A;&#x4E0B;&#x6587;&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x6BCF;&#x6B21;&#x4E0A;&#x4E0B;&#x6587;&#x5207;&#x6362;&#x65F6;&#xFF0C;CR3&#x7684;&#x503C;&#x90FD;&#x4F1A;&#x88AB;&#x6062;&#x590D;&#x3002;36&#x4F4D;VPN&#x88AB;&#x5212;&#x5206;&#x6210;&#x56DB;&#x4E2A;9&#x4F4D;&#x7684;&#x7247;&#xFF0C;&#x6BCF;&#x4E2A;&#x7247;&#x88AB;&#x7528;&#x4F5C;&#x5230;&#x4E00;&#x4E2A;&#x9875;&#x8868;&#x7684;&#x504F;&#x79FB;&#x91CF;&#x3002;CR3&#x5BC4;&#x5B58;&#x5668;&#x5305;&#x542B;L1&#x9875;&#x8868;&#x7684;&#x7269;&#x7406;&#x5730;&#x5740;&#x3002;VPN1&#x63D0;&#x4F9B;&#x5230;&#x4E00;&#x4E2A;L1 PET&#x7684;&#x504F;&#x79FB;&#x91CF;&#xFF0C;&#x8FD9;&#x4E2A;PTE&#x5305;&#x542B;L2&#x9875;&#x8868;&#x7684;&#x57FA;&#x5730;&#x5740;&#x3002;VPN2&#x63D0;&#x4F9B;&#x5230;&#x4E00;&#x4E2A;L2 PTE&#x7684;&#x504F;&#x79FB;&#x91CF;&#xFF0C;&#x4EE5;&#x6B64;&#x7C7B;&#x63A8;&#x3002;</p>
<h2 id="75-&#x4E09;&#x7EA7;cache&#x652F;&#x6301;&#x4E0B;&#x7684;&#x7269;&#x7406;&#x5185;&#x5B58;&#x8BBF;&#x95EE;">7.5 &#x4E09;&#x7EA7;Cache&#x652F;&#x6301;&#x4E0B;&#x7684;&#x7269;&#x7406;&#x5185;&#x5B58;&#x8BBF;&#x95EE;</h2>
<p>&#x65E9;&#x671F;&#x8BA1;&#x7B97;&#x673A;&#x7CFB;&#x7EDF;&#x7684;&#x5B58;&#x50A8;&#x5668;&#x5B58;&#x50A8;&#x5C42;&#x6B21;&#x53EA;&#x6709;&#x4E09;&#x5C42;&#xFF1A;CPU&#x5BC4;&#x5B58;&#x5668;&#x3001;DRAM&#x4E3B;&#x5B58;&#x50A8;&#x5668;&#x548C;&#x78C1;&#x76D8;&#x5B58;&#x50A8;&#x3002;&#x4E0D;&#x8FC7;&#xFF0C;&#x7531;&#x4E8E;CPU&#x548C;&#x4E3B;&#x5B58;&#x4E4B;&#x95F4;&#x9010;&#x6E10;&#x589E;&#x5927;&#x7684;&#x5DEE;&#x8DDD;&#xFF0C;&#x7CFB;&#x7EDF;&#x8BBE;&#x8BA1;&#x8005;&#x88AB;&#x8FEB;&#x5728;CPU&#x5BC4;&#x5B58;&#x5668;&#x6587;&#x4EF6;&#x548C;&#x4E3B;&#x5B58;&#x4E4B;&#x95F4;&#x63D2;&#x5165;&#x4E86;&#x4E00;&#x4E2A;&#x5C0F;&#x7684;SRAM&#x9AD8;&#x901F;&#x7F13;&#x5B58;&#x5B58;&#x50A8;&#x5668;&#xFF0C;&#x79F0;&#x4E3A;<strong>L1&#x9AD8;&#x901F;&#x7F13;&#x5B58;</strong>&#xFF08;&#x4E00;&#x7EA7;&#x7F13;&#x5B58;&#xFF09;&#x3002;L1&#x9AD8;&#x901F;&#x7F13;&#x5B58;&#x7684;&#x8BBF;&#x95EE;&#x901F;&#x5EA6;&#x51E0;&#x4E4E;&#x548C;&#x5BC4;&#x5B58;&#x5668;&#x4E00;&#x6837;&#x5FEB;&#xFF0C;&#x5178;&#x578B;&#x5730;&#x5927;&#x7EA6;&#x662F;4&#x4E2A;&#x65F6;&#x949F;&#x5468;&#x671F;&#xFF0C;&#x968F;&#x7740;CPU&#x548C;&#x4E3B;&#x5B58;&#x4E4B;&#x95F4;&#x7684;&#x6027;&#x80FD;&#x5DEE;&#x8DDD;&#x4E0D;&#x65AD;&#x589E;&#x5927;&#xFF0C;&#x7CFB;&#x7EDF;&#x8BBE;&#x8BA1;&#x8005;&#x5728;L1&#x9AD8;&#x901F;&#x7F13;&#x5B58;&#x548C;&#x4E3B;&#x5B58;&#x4E4B;&#x95F4;&#x6709;&#x63D2;&#x5165;&#x4E86;&#x4E00;&#x4E2A;&#x66F4;&#x5927;&#x7684;&#x9AD8;&#x901F;&#x7F13;&#x5B58;&#xFF0C;&#x79F0;&#x4E3A;<strong>L2&#x9AD8;&#x901F;&#x7F13;&#x5B58;</strong>&#xFF0C;&#x53EF;&#x4EE5;&#x5728;&#x5927;&#x7EA6;10&#x4E2A;&#x65F6;&#x949F;&#x5468;&#x671F;&#x5185;&#x8BBF;&#x95EE;&#x5230;&#x5B83;&#x3002;&#x6709;&#x4E9B;&#x73B0;&#x4EE3;&#x7CFB;&#x7EDF;&#x8FD8;&#x5305;&#x62EC;&#x6709;&#x4E00;&#x4E2A;&#x66F4;&#x5927;&#x7684;&#x9AD8;&#x901F;&#x7F13;&#x5B58;&#xFF0C;&#x79F0;&#x4E3A;<strong>L3&#x9AD8;&#x901F;&#x7F13;&#x5B58;</strong>&#xFF0C;&#x5728;&#x5B58;&#x50A8;&#x5668;&#x7684;&#x5C42;&#x6B21;&#x7ED3;&#x6784;&#x4E2D;&#xFF0C;&#x5B83;&#x4F4D;&#x4E8E;L2&#x9AD8;&#x901F;&#x7F13;&#x5B58;&#x548C;&#x4E3B;&#x5B58;&#x4E4B;&#x95F4;&#xFF0C;&#x53EF;&#x4EE5;&#x5728;&#x5927;&#x7EA6;50&#x4E2A;&#x65F6;&#x949F;&#x5468;&#x671F;&#x5185;&#x8BBF;&#x95EE;&#x5230;&#x5B83;&#x3002;</p>
<p><img src="Users/zhangenshang/Desktop/&#x5927;&#x4F5C;&#x4E1A;&#x7AE0;&#x8282;/Chapter7/&#x5C4F;&#x5E55;&#x5FEB;&#x7167; 2018-12-28 &#x4E0B;&#x5348;8.09.58.png" alt="&#x5C4F;&#x5E55;&#x5FEB;&#x7167; 2018-12-28 &#x4E0B;&#x5348;8.09.58"></p>
<p>&#x5176;&#x4E2D;&#xFF0C;&#x53C2;&#x6570;S&#x548C;B&#x5C06;m&#x4E2A;&#x5730;&#x5740;&#x4E3A;&#x5206;&#x4E3A;&#x4E86;&#x4E09;&#x4E2A;&#x5B57;&#x6BB5;&#x3002;&#x5982;6-25b&#x6240;&#x793A;&#xFF0C;A&#x4E2D;s&#x4E2A;<strong>&#x7EC4;&#x7D22;&#x5F15;&#x4F4D;</strong>&#x662F;&#x4E00;&#x4E2A;&#x5230;S&#x4E2A;&#x7EC4;&#x7684;&#x6570;&#x7EC4;&#x7684;&#x7D22;&#x5F15;&#x3002;&#x7B2C;&#x4E00;&#x4E2A;&#x7EC4;&#x662F;&#x7EC4;0&#xFF0C;&#x7B2C;&#x4E8C;&#x4E2A;&#x7EC4;&#x662F;&#x7EC4;1&#xFF0C;&#x4F9D;&#x6B64;&#x7C7B;&#x63A8;&#x3002;&#x7EC4;&#x7D22;&#x5F15;&#x4F4D;&#x88AB;&#x89E3;&#x91CA;&#x4E3A;&#x4E00;&#x4E2A;&#x65E0;&#x7B26;&#x53F7;&#x6574;&#x6570;&#xFF0C;&#x5B83;&#x544A;&#x8BC9;&#x6211;&#x4EEC;&#x8FD9;&#x4E2A;&#x5B57;&#x5FC5;&#x987B;&#x88AB;&#x5B58;&#x50A8;&#x5230;&#x54EA;&#x4E2A;&#x7EC4;&#x4E2D;&#x3002;&#x4E00;&#x65E6;&#x6211;&#x4EEC;&#x77E5;&#x9053;&#x4E86;&#x8FD9;&#x4E2A;&#x5B57;&#x5FC5;&#x987B;&#x88AB;&#x653E;&#x5728;&#x54EA;&#x4E2A;&#x7EC4;&#x4E2D;&#xFF0C;A&#x4E2D;&#x7684;t&#x4E2A;&#x6807;&#x8BB0;&#x4F4D;&#x5C31;&#x544A;&#x8BC9;&#x6211;&#x4EEC;&#x8FD9;&#x4E2A;&#x7EC4;&#x7684;&#x54EA;&#x4E00;&#x884C;&#x5305;&#x542B;&#x8FD9;&#x4E2A;&#x5B57;&#x3002;&#x5F53;&#x4E14;&#x4EC5;&#x5F53;&#x8BBE;&#x7F6E;&#x4E86;&#x6709;&#x6548;&#x4F4D;&#x5E76;&#x4E14;&#x8BE5;&#x884C;&#x7684;&#x6807;&#x8BB0;&#x4E3A;&#x4E0E;&#x5730;&#x5740;A&#x7684;&#x6807;&#x8BB0;&#x4E3A;&#x76F8;&#x5339;&#x914D;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x7EC4;&#x4E2D;&#x7684;&#x8FD9;&#x4E00;&#x884C;&#x624D;&#x5305;&#x542B;&#x8FD9;&#x4E2A;&#x5B57;&#x3002;&#x4E00;&#x65E6;&#x6211;&#x4EEC;&#x5728;&#x7531;&#x7EC4;&#x7D22;&#x5F15;&#x6807;&#x8BC6;&#x7684;&#x7EC4;&#x4E2D;&#x5B9A;&#x4F4D;&#x4E86;&#x7531;&#x6807;&#x53F7;&#x6240;&#x6807;&#x8BC6;&#x7684;&#x884C;&#xFF0C;&#x90A3;&#x4E48;b&#x4E2A;&#x5757;&#x504F;&#x79FB;&#x4F4D;&#x7ED9;&#x51FA;&#x4E86;&#x5728;B&#x4E2A;&#x5B57;&#x8282;&#x7684;&#x6570;&#x636E;&#x5757;&#x4E2D;&#x7684;&#x5B57;&#x504F;&#x79FB;&#x3002;&#x5BF9;&#x4E8E;&#x4E09;&#x7EA7;&#x7F13;&#x5B58;Cache&#x6765;&#x8BF4;&#xFF0C;&#x4ECE;&#x7B2C;&#x4E00;&#x7EA7;L1&#x5FEB;&#x901F;&#x7F13;&#x5B58;&#x5F00;&#x59CB;&#x6267;&#x884C;&#x4EE5;&#x4E0A;&#x7684;&#x64CD;&#x4F5C;&#xFF0C;&#x5982;&#x679C;&#x547D;&#x4E2D;&#x7684;&#x8BDD;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x53D6;&#x51FA;&#x6240;&#x5BF9;&#x5E94;&#x7684;&#x6570;&#x636E;&#x5757;&#xFF0C;&#x5426;&#x5219;&#x5C31;&#x7EE7;&#x7EED;&#x5BF9;L2&#x9AD8;&#x901F;&#x7F13;&#x5B58;&#x6267;&#x884C;&#x4EE5;&#x4E0A;&#x7684;&#x64CD;&#x4F5C;&#xFF0C;&#x5982;&#x679C;&#x547D;&#x4E2D;&#x5C31;&#x53D6;&#x51FA;&#x5BF9;&#x5E94;&#x7684;&#x6570;&#x636E;&#x5757;&#x3002;&#x82E5;&#x5728;L3&#x9AD8;&#x901F;&#x7F13;&#x5B58;&#x547D;&#x4E2D;&#xFF0C;&#x90A3;&#x4E48;&#x53D6;&#x51FA;&#x5BF9;&#x5E94;&#x7684;&#x6570;&#x636E;&#x5757;&#x3002;&#x5982;&#x679C;L3&#x7F13;&#x5B58;&#x4E0D;&#x547D;&#x4E2D;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;Cache&#x5C31;&#x4F1A;&#x5B58;&#x5185;&#x5B58;&#x4E2D;&#x53D6;&#x51FA;&#x5305;&#x542B;&#x8FD9;&#x4E2A;&#x5B57;&#x7684;&#x5757;&#xFF0C;&#x7136;&#x540E;&#x5229;&#x7528;LFU&#x6216;&#x8005;LRU&#x7B56;&#x7565;&#x53BB;&#x66FF;&#x6362;&#x6389;&#x8FD9;&#x4E2A;&#x884C;&#x3002;<img src="Users/zhangenshang/Desktop/&#x5927;&#x4F5C;&#x4E1A;&#x7AE0;&#x8282;/Chapter7/&#x5C4F;&#x5E55;&#x5FEB;&#x7167; 2018-12-28 &#x4E0B;&#x5348;8.22.55.png" alt="&#x5C4F;&#x5E55;&#x5FEB;&#x7167; 2018-12-28 &#x4E0B;&#x5348;8.22.55"></p>
<h2 id="76-hello&#x8FDB;&#x7A0B;fork&#x65F6;&#x7684;&#x5185;&#x5B58;&#x6620;&#x5C04;">7.6 hello&#x8FDB;&#x7A0B;fork&#x65F6;&#x7684;&#x5185;&#x5B58;&#x6620;&#x5C04;</h2>
<p>&#x9996;&#x5148;&#x5148;&#x8BF4;&#x4E00;&#x4E0B;&#x4EC0;&#x4E48;&#x662F;<strong>&#x5185;&#x5B58;&#x6620;&#x5C04;</strong>&#x3002;</p>
<p>Linux&#x901A;&#x8FC7;&#x5C06;&#x4E00;&#x4E2A;&#x865A;&#x62DF;&#x5185;&#x5B58;&#x533A;&#x57DF;&#x4E0E;&#x4E00;&#x4E2A;&#x78C1;&#x76D8;&#x4E0A;&#x7684;<strong>&#x5BF9;&#x8C61;</strong>&#x5173;&#x8054;&#x8D77;&#x6765;&#xFF0C;&#x4EE5;&#x521D;&#x59CB;&#x5316;&#x8FD9;&#x4E2A;&#x865A;&#x62DF;&#x5185;&#x5B58;&#x533A;&#x57DF;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x79F0;&#x4E3A;<strong>&#x5185;&#x5B58;&#x6620;&#x5C04;</strong>&#x3002;&#x865A;&#x62DF;&#x5185;&#x5B58;&#x533A;&#x57DF;&#x53EF;&#x4EE5;&#x6620;&#x5C04;&#x5230;<strong>Linux&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x4E2D;&#x7684;&#x666E;&#x901A;&#x6587;&#x4EF6;</strong>&#x6216;&#x8005;<strong>&#x533F;&#x540D;&#x6587;&#x4EF6;</strong>&#xFF0C;&#x65E0;&#x8BBA;&#x5728;&#x54EA;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4E00;&#x65E6;&#x4E00;&#x4E2A;&#x865A;&#x62DF;&#x9875;&#x9762;&#x88AB;&#x521D;&#x59CB;&#x5316;&#x4E86;&#xFF0C;&#x5B83;&#x5C31;&#x5728;&#x4E00;&#x4E2A;&#x7531;&#x5185;&#x6838;&#x7EF4;&#x62A4;&#x7684;&#x4E13;&#x95E8;&#x7684;<strong>&#x4EA4;&#x6362;&#x6587;&#x4EF6;</strong>&#x6362;&#x6765;&#x6362;&#x53BB;&#x3002;&#x4EA4;&#x6362;&#x6587;&#x4EF6;&#x4E5F;&#x53EB;&#x505A;<strong>&#x4EA4;&#x6362;&#x7A7A;&#x95F4;</strong>&#x6216;&#x8005;<strong>&#x4EA4;&#x6362;&#x533A;&#x57DF;</strong>&#x3002;&#x5728;&#x4EFB;&#x4F55;&#x65F6;&#x523B;&#xFF0C;&#x4EA4;&#x6362;&#x7A7A;&#x95F4;&#x90FD;&#x9650;&#x5236;&#x7740;&#x5F53;&#x524D;&#x8FD0;&#x884C;&#x7740;&#x7684;&#x8FDB;&#x7A0B;&#x80FD;&#x591F;&#x5206;&#x914D;&#x7684;&#x865A;&#x62DF;&#x9875;&#x9762;&#x7684;&#x603B;&#x6570;&#x3002;</p>
<p>&#x5F53;fork&#x51FD;&#x6570;&#x88AB;<strong>&#x5F53;&#x524D;&#x8FDB;&#x7A0B;</strong>&#xFF08;&#x8FD9;&#x91CC;&#x662F;Linux&#x7684;shell&#x8FDB;&#x7A0B;&#xFF09;&#x8C03;&#x7528;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5185;&#x6838;&#x4E3A;&#x65B0;&#x8FDB;&#x7A0B;&#x521B;&#x5EFA;&#x4E86;&#x5404;&#x79CD;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x5E76;&#x5206;&#x914D;&#x7ED9;&#x8FDB;&#x7A0B;&#x4E00;&#x4E2A;&#x552F;&#x4E00;&#x7684;PID&#xFF0C;&#x5728;&#x8FD9;&#x91CC;&#x5C31;&#x662F;&#x4E4B;&#x524D;&#x8F93;&#x51FA;&#x7684;hello&#x7A0B;&#x5E8F;&#x7684;PID&#x3002;&#x4E3A;&#x4E86;&#x7ED9;&#x8FD9;&#x4E2A;&#x65B0;&#x8FDB;&#x7A0B;&#x521B;&#x5EFA;&#x865A;&#x62DF;&#x5185;&#x5B58;&#xFF0C;&#x5B83;&#x521B;&#x5EFA;&#x4E86;&#x5F53;&#x524D;&#x8FDB;&#x7A0B;&#x7684;mm_struct&#x3001;&#x533A;&#x57DF;&#x7ED3;&#x6784;&#x548C;&#x9875;&#x8868;&#x7684;&#x539F;&#x6837;&#x526F;&#x672C;&#x3002;&#x5B83;&#x5C06;&#x4E24;&#x4E2A;&#x8FDB;&#x7A0B;&#x4E2D;&#x7684;&#x6BCF;&#x4E2A;&#x9875;&#x9762;&#x90FD;&#x6807;&#x8BB0;&#x4E3A;&#x53EA;&#x8BFB;&#xFF0C;&#x5E76;&#x5C06;&#x4E24;&#x4E2A;&#x8FDB;&#x7A0B;&#x4E2D;&#x7684;&#x6BCF;&#x4E2A;&#x533A;&#x57DF;&#x7ED3;&#x6784;&#x90FD;&#x6807;&#x8BB0;&#x4E3A;&#x79C1;&#x6709;&#x7684;&#x5199;&#x65F6;&#x590D;&#x5236;&#x3002;&#x5F53;fork&#x5728;Hello&#x7684;&#x8FDB;&#x7A0B;&#x4E2D;&#x8FD4;&#x56DE;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x8FD9;&#x4E2A;Hekki&#x7684;&#x865A;&#x62DF;&#x5185;&#x5B58;&#x521A;&#x597D;&#x548C;&#x8C03;&#x7528;fork&#x65F6;&#x5B58;&#x5728;&#x7684;&#x865A;&#x62DF;&#x5185;&#x5B58;&#x76F8;&#x540C;&#x3002;&#x5F53;&#x8FD9;&#x4E24;&#x4E2A;&#x8FDB;&#x7A0B;&#x4E2D;&#x7684;&#x4EFB;&#x610F;&#x4E00;&#x4E2A;&#x540E;&#x6765;&#x8FDB;&#x884C;&#x5199;&#x64CD;&#x4F5C;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5199;&#x65F6;&#x590D;&#x5236;&#x673A;&#x5236;&#x5C31;&#x4F1A;&#x521B;&#x5EFA;&#x66F4;&#x591A;&#x65B0;&#x9875;&#x9762;&#xFF0C;&#x56E0;&#x6B64;&#xFF0C;&#x4E5F;&#x5C31;&#x4E3A;&#x6BCF;&#x4E2A;&#x8FDB;&#x7A0B;&#x4FDD;&#x6301;&#x4E86;&#x79C1;&#x6709;&#x5730;&#x5740;&#x7A7A;&#x95F4;&#x7684;&#x62BD;&#x8C61;&#x6982;&#x5FF5;&#x3002;</p>
<h2 id="77-hello&#x8FDB;&#x7A0B;execve&#x65F6;&#x7684;&#x5185;&#x5B58;&#x6620;&#x5C04;">7.7 hello&#x8FDB;&#x7A0B;execve&#x65F6;&#x7684;&#x5185;&#x5B58;&#x6620;&#x5C04;</h2>
<p>&#x5728;&#x5F53;&#x524D;hello&#x8FDB;&#x7A0B;&#x4E2D;&#x7684;&#x7A0B;&#x5E8F;&#x6267;&#x884C;&#x4E86;execve&#x51FD;&#x6570;&#xFF0C;&#x800C;execve&#x51FD;&#x6570;&#x5728;&#x5F53;&#x524D;&#x8FDB;&#x7A0B;&#x4E2D;&#x52A0;&#x8F7D;&#x5E76;&#x8FD0;&#x884C;&#x5305;&#x542B;&#x5728;&#x53EF;&#x6267;&#x884C;&#x76EE;&#x6807;&#x6587;&#x4EF6;<code>a.out</code>&#x4E2D;&#x7684;&#x7A0B;&#x5E8F;&#xFF0C;&#x7528;a.out&#x7A0B;&#x5E8F;&#x6709;&#x6548;&#x5730;&#x66FF;&#x4EE3;&#x4E86;&#x5F53;&#x524D;&#x7A0B;&#x5E8F;&#x3002;&#x52A0;&#x8F7D;&#x5E76;&#x8FD0;&#x884C;a.out&#x9700;&#x8981;&#x4E00;&#x4E0B;&#x51E0;&#x4E2A;&#x6B65;&#x9AA4;&#xFF1A;</p>
<ul>
<li><strong>&#x5220;&#x9664;&#x5DF2;&#x5B58;&#x5728;&#x7684;&#x7528;&#x6237;&#x533A;&#x57DF;&#x3002;</strong>&#x5220;&#x9664;&#x5F53;&#x524D;&#x8FDB;&#x7A0B;&#x865A;&#x62DF;&#x5730;&#x5740;&#x7684;&#x7528;&#x6237;&#x90E8;&#x5206;&#x4E2D;&#x5DF2;&#x5B58;&#x5728;&#x7684;&#x533A;&#x57DF;&#x7ED3;&#x6784;&#x3002;</li>
<li><strong>&#x6620;&#x5C04;&#x79C1;&#x6709;&#x533A;&#x57DF;&#x3002;</strong>&#x4E3A;&#x65B0;&#x7A0B;&#x5E8F;&#x7684;&#x4EE3;&#x7801;&#x3001;&#x6570;&#x636E;&#x3001;bss&#x548C;&#x6808;&#x533A;&#x57DF;&#x521B;&#x5EFA;&#x65B0;&#x7684;&#x533A;&#x57DF;&#x7ED3;&#x6784;&#x3002;&#x6240;&#x6709;&#x8FD9;&#x4E9B;&#x65B0;&#x7684;&#x533A;&#x57DF;&#x90FD;&#x662F;&#x79C1;&#x6709;&#x7684;&#x3001;&#x5199;&#x65F6;&#x590D;&#x5236;&#x7684;&#x3002;&#x4EE3;&#x7801;&#x548C;&#x6570;&#x636E;&#x533A;&#x57DF;&#x88AB;&#x6620;&#x5C04;&#x4E3A;hello &#x6587;&#x4EF6;&#x4E2D;&#x7684;.text&#x548C;.data &#x533A;&#x3002;bss &#x533A;&#x57DF;&#x662F;&#x8BF7;&#x6C42;&#x4E8C;&#x8FDB;&#x5236;&#x96F6;&#x7684;&#xFF0C;&#x6620;&#x5C04;&#x5230;&#x533F;&#x540D;&#x6587;&#x4EF6;&#xFF0C;&#x5176;&#x5927;&#x5C0F;&#x5305;&#x542B;&#x5728;hello &#x4E2D;&#x3002;&#x6808;&#x548C;&#x5806;&#x533A;&#x57DF;&#x4E5F;&#x662F;&#x8BF7;&#x6C42;&#x4E8C;&#x8FDB;&#x5236;&#x96F6;&#x7684;&#xFF0C;&#x521D;&#x59CB;&#x957F;&#x5EA6;&#x4E3A;&#x96F6;&#x3002;</li>
<li><strong>&#x6620;&#x5C04;&#x5171;&#x4EAB;&#x533A;&#x57DF;&#x3002;</strong>&#x5982;&#x679C;hello&#x7A0B;&#x5E8F;&#x4E0E;&#x5171;&#x4EAB;&#x5BF9;&#x8C61;&#xFF08;&#x6216;&#x76EE;&#x6807;&#xFF09;&#x94FE;&#x63A5;&#xFF0C;&#x6BD4;&#x5982;&#x6807;&#x51C6;C &#x5E93;libc. so, &#x90A3;&#x4E48;&#x8FD9;&#x4E9B;&#x5BF9;&#x8C61;&#x90FD;&#x662F;&#x52A8;&#x6001;&#x94FE;&#x63A5;&#x5230;&#x8FD9;&#x4E2A;&#x7A0B;&#x5E8F;&#x7684;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x6620;&#x5C04;&#x5230;&#x7528;&#x6237;&#x865A;&#x62DF;&#x5730;&#x5740;&#x7A7A;&#x95F4;&#x4E2D;&#x7684;&#x5171;&#x4EAB;&#x533A;&#x57DF;&#x5185;&#x3002;</li>
<li><strong>&#x8BBE;&#x7F6E;&#x7A0B;&#x5E8F;&#x8BA1;&#x6570;&#x5668;(PC) &#x3002;</strong>execve &#x505A;&#x7684;&#x6700;&#x540E;&#x4E00;&#x4EF6;&#x4E8B;&#x60C5;&#x5C31;&#x662F;&#x8BBE;&#x7F6E;&#x5F53;&#x524D;&#x8FDB;&#x7A0B;&#x4E0A;&#x4E0B;&#x6587;&#x4E2D;&#x7684;&#x7A0B;&#x5E8F;&#x8BA1;&#x6570;&#x5668;&#xFF0C;&#x4F7F;&#x4E4B;&#x6307;&#x5411;&#x4EE3;&#x7801;&#x533A;&#x57DF;&#x7684;&#x5165;&#x53E3;&#x70B9;&#x3002;</li>
</ul>
<p>&#x4E0B;&#x4E00;&#x6B21;&#x8C03;&#x5EA6;hello&#x8FDB;&#x7A0B;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5B83;&#x5C06;&#x4ECE;&#x8FD9;&#x4E2A;&#x5165;&#x53E3;&#x70B9;&#x5F00;&#x59CB;&#x6267;&#x884C;&#x3002;Linux&#x5C06;&#x6839;&#x636E;&#x9700;&#x8981;&#x6362;&#x5165;&#x4EE3;&#x7801;&#x548C;&#x6570;&#x636E;&#x9875;&#x9762;&#x3002;</p>
<p><img src="Users/zhangenshang/Desktop/&#x5927;&#x4F5C;&#x4E1A;&#x7AE0;&#x8282;/Chapter7/&#x5C4F;&#x5E55;&#x5FEB;&#x7167; 2018-12-28 &#x4E0B;&#x5348;8.40.43.png" alt="&#x5C4F;&#x5E55;&#x5FEB;&#x7167; 2018-12-28 &#x4E0B;&#x5348;8.40.43"></p>
<h2 id="78-&#x7F3A;&#x9875;&#x6545;&#x969C;&#x548C;&#x7F3A;&#x9875;&#x4E2D;&#x65AD;&#x5904;&#x7406;">7.8 &#x7F3A;&#x9875;&#x6545;&#x969C;&#x548C;&#x7F3A;&#x9875;&#x4E2D;&#x65AD;&#x5904;&#x7406;</h2>
<p>&#x5728;&#x865A;&#x62DF;&#x5185;&#x5B58;&#x7684;&#x4E60;&#x60EF;&#x8BF4;&#x6CD5;&#x4E2D;&#xFF0C;DRAM&#x7F13;&#x5B58;&#x4E0D;&#x547D;&#x4E2D;&#x79F0;&#x4E3A;<strong>&#x7F3A;&#x9875;</strong>&#x3002;&#x8FDB;&#x7A0B;&#x7EBF;&#x6027;&#x5730;&#x5740;&#x7A7A;&#x95F4;&#x91CC;&#x7684;&#x9875;&#x9762;&#x4E0D;&#x5FC5;&#x5E38;&#x9A7B;&#x5185;&#x5B58;&#xFF0C;&#x5728;&#x6267;&#x884C;&#x4E00;&#x6761;&#x6307;&#x4EE4;&#x65F6;&#xFF0C;&#x5982;&#x679C;&#x53D1;&#x73B0;&#x4ED6;&#x8981;&#x8BBF;&#x95EE;&#x7684;&#x9875;&#x6CA1;&#x6709;&#x5728;&#x5185;&#x5B58;&#x4E2D;&#xFF08;&#x5B58;&#x5728;&#x4F4D;&#x4E3A;0&#xFF09;&#xFF0C;&#x90A3;&#x4E48;&#x505C;&#x6B62;&#x8BE5;&#x6307;&#x4EE4;&#x7684;&#x6267;&#x884C;&#xFF0C;&#x5E76;&#x4EA7;&#x751F;&#x4E00;&#x4E2A;&#x9875;&#x4E0D;&#x5B58;&#x5728;&#x5F02;&#x5E38;&#xFF0C;&#x5BF9;&#x5E94;&#x7684;&#x6545;&#x969C;&#x5904;&#x7406;&#x7A0B;&#x5E8F;&#x53EF;&#x901A;&#x8FC7;&#x4ECE;&#x5916;&#x5B58;&#x52A0;&#x8F7D;&#x52A0;&#x8F7D;&#x8BE5;&#x9875;&#x5230;&#x5185;&#x5B58;&#x7684;&#x65B9;&#x6CD5;&#x6765;&#x6392;&#x9664;&#x6545;&#x969C;&#xFF0C;&#x4E4B;&#x540E;&#xFF0C;&#x539F;&#x5148;&#x5F15;&#x8D77;&#x7684;&#x5F02;&#x5E38;&#x7684;&#x6307;&#x4EE4;&#x5C31;&#x53EF;&#x4EE5;&#x7EE7;&#x7EED;&#x6267;&#x884C;&#xFF0C;&#x800C;&#x4E0D;&#x518D;&#x4EA7;&#x751F;&#x5F02;&#x5E38;&#x3002;</p>
<p>&#x4E66;&#x4E2D;&#x7684;&#x4F8B;&#x5B50;&#x662F;&#xFF0C; CPU &#x5F15;&#x7528;&#x4E86;VP 3 &#x4E2D;&#x7684;&#x4E00;&#x4E2A;&#x5B57;&#xFF0C; VP 3 &#x5E76;&#x672A;&#x7F13;&#x5B58;&#x5728;DRAM &#x4E2D;&#x3002;&#x5730;&#x5740;&#x7FFB;&#x8BD1;&#x786C;&#x4EF6;&#x4ECE;&#x5185;&#x5B58;&#x4E2D;&#x8BFB;&#x53D6;PTE 3, &#x4ECE;&#x6709;&#x6548;&#x4F4D;&#x63A8;&#x65AD;&#x51FA;VP 3 &#x672A;&#x88AB;&#x7F13;&#x5B58;&#xFF0C;&#x5E76;&#x4E14;&#x89E6;&#x53D1;&#x4E00;&#x4E2A;&#x7F3A;&#x9875;&#x5F02;&#x5E38;&#x3002;&#x7F3A;&#x9875;&#x5F02;&#x5E38;&#x8C03;&#x7528;&#x5185;&#x6838;&#x4E2D;&#x7684;&#x7F3A;&#x9875;&#x5F02;&#x5E38;&#x5904;&#x7406;&#x7A0B;&#x5E8F;&#xFF0C;&#x8BE5;&#x7A0B;&#x5E8F;&#x4F1A;&#x9009;&#x62E9;&#x4E00;&#x4E2A;&#x727A;&#x7272;&#x9875;&#xFF0C;&#x5728;&#x6B64;&#x4F8B;&#x4E2D;&#x5C31;&#x662F;&#x5B58;&#x653E;&#x5728;PP3&#x4E2D;&#x7684;VP4 &#x3002;&#x5982;&#x679C;VP4&#x5DF2;&#x7ECF;&#x88AB;&#x4FEE;&#x6539;&#x4E86;&#xFF0C;&#x90A3;&#x4E48;&#x5185;&#x6838;&#x5C31;&#x4F1A;&#x5C06;&#x5B83;&#x590D;&#x5236;&#x56DE;&#x78C1;&#x76D8;&#x3002;&#x65E0;&#x8BBA;&#x54EA;&#x79CD;&#x60C5;&#x51B5;&#xFF0C;&#x5185;&#x6838;&#x90FD;&#x4F1A;&#x4FEE;&#x6539;VP4 &#x7684;&#x9875;&#x8868;&#x6761;&#x76EE;&#xFF0C;&#x53CD;&#x6620;&#x51FA;VP 4 &#x4E0D;&#x518D;&#x7F13;&#x5B58;&#x5728;&#x4E3B;&#x5B58;&#x4E2D;&#x8FD9;&#x4E00;&#x4E8B;&#x5B9E;&#x3002;</p>
<p><img src="Users/zhangenshang/Desktop/&#x5927;&#x4F5C;&#x4E1A;&#x7AE0;&#x8282;/Chapter7/&#x5C4F;&#x5E55;&#x5FEB;&#x7167; 2018-12-28 &#x4E0B;&#x5348;8.47.07.png" alt="&#x5C4F;&#x5E55;&#x5FEB;&#x7167; 2018-12-28 &#x4E0B;&#x5348;8.47.07"></p>
<p>&#x7F3A;&#x9875;&#x4E2D;&#x65AD;&#x5904;&#x7406;&#x7684;&#x4E00;&#x822C;&#x6D41;&#x7A0B;&#x5982;&#x4E0B;&#xFF1A;</p>
<p>1.&#x786C;&#x4EF6;&#x9677;&#x5165;&#x5185;&#x6838;&#xFF0C;&#x5728;&#x5806;&#x6808;&#x4E2D;&#x4FDD;&#x5B58;&#x7A0B;&#x5E8F;&#x8BA1;&#x6570;&#x5668;&#xFF0C;&#x5927;&#x591A;&#x6570;&#x5F53;&#x524D;&#x6307;&#x4EE4;&#x7684;&#x5404;&#x79CD;&#x72B6;&#x6001;&#x4FE1;&#x606F;&#x4FDD;&#x5B58;&#x5728;&#x7279;&#x6B8A;&#x7684;cpu&#x5BC4;&#x5B58;&#x5668;&#x4E2D;&#x3002;</p>
<p>2.&#x542F;&#x52A8;&#x4E00;&#x4E2A;&#x6C47;&#x7F16;&#x4F8B;&#x7A0B;&#x4FDD;&#x5B58;&#x901A;&#x7528;&#x5BC4;&#x5B58;&#x5668;&#x548C;&#x5176;&#x4ED6;&#x6613;&#x4E22;&#x5931;&#x4FE1;&#x606F;&#xFF0C;&#x4EE5;&#x514D;&#x88AB;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x7834;&#x574F;&#x3002;</p>
<p>3.&#x5F53;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x53D1;&#x73B0;&#x7F3A;&#x9875;&#x4E2D;&#x65AD;&#x65F6;&#xFF0C;&#x5C1D;&#x8BD5;&#x53D1;&#x73B0;&#x9700;&#x8981;&#x54EA;&#x4E2A;&#x865A;&#x62DF;&#x9875;&#x9762;&#x3002;&#x901A;&#x5E38;&#x4E00;&#x4E2A;&#x786C;&#x4EF6;&#x5BC4;&#x5B58;&#x5668;&#x5305;&#x542B;&#x4E86;&#x8FD9;&#x4E9B;&#x4FE1;&#x606F;&#xFF0C;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x7684;&#x8BDD;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x5FC5;&#x987B;&#x68C0;&#x7D22;&#x7A0B;&#x5E8F;&#x8BA1;&#x6570;&#x5668;&#xFF0C;&#x53D6;&#x51FA;&#x5F53;&#x524D;&#x6307;&#x4EE4;&#xFF0C;&#x5206;&#x6790;&#x5F53;&#x524D;&#x6307;&#x4EE4;&#x6B63;&#x5728;&#x505A;&#x4EC0;&#x4E48;&#x3002;</p>
<p>4.&#x4E00;&#x65E6;&#x77E5;&#x9053;&#x4E86;&#x53D1;&#x751F;&#x7F3A;&#x9875;&#x4E2D;&#x65AD;&#x7684;&#x865A;&#x62DF;&#x5730;&#x5740;&#xFF0C;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x4F1A;&#x68C0;&#x67E5;&#x5730;&#x5740;&#x662F;&#x5426;&#x6709;&#x6548;&#xFF0C;&#x5E76;&#x68C0;&#x67E5;&#x8BFB;&#x5199;&#x662F;&#x5426;&#x4E0E;&#x4FDD;&#x62A4;&#x6743;&#x9650;&#x4E00;&#x81F4;&#xFF0C;&#x4E0D;&#x8FC7;&#x4E0D;&#x4E00;&#x81F4;&#xFF0C;&#x5219;&#x5411;&#x8FDB;&#x7A0B;&#x53D1;&#x4E00;&#x4E2A;&#x4FE1;&#x53F7;&#x6216;&#x8005;&#x6740;&#x6B7B;&#x8BE5;&#x8FDB;&#x7A0B;&#x3002;&#x5982;&#x679C;&#x662F;&#x6709;&#x6548;&#x5730;&#x5740;&#x5E76;&#x4E14;&#x6CA1;&#x6709;&#x4FDD;&#x62A4;&#x9519;&#x8BEF;&#x53D1;&#x751F;&#x5219;&#x7CFB;&#x7EDF;&#x68C0;&#x67E5;&#x662F;&#x5426;&#x6709;&#x7A7A;&#x95F2;&#x9875;&#x6846;&#x3002;&#x5982;&#x679C;&#x6CA1;&#x6709;&#xFF0C;&#x5219;&#x6267;&#x884C;&#x9875;&#x9762;&#x7F6E;&#x6362;&#x7B97;&#x6CD5;&#x6DD8;&#x6C70;&#x9875;&#x9762;&#x3002;</p>
<p>5.&#x5982;&#x679C;&#x9009;&#x62E9;&#x7684;&#x9875;&#x6846;&#x810F;&#x4E86;&#xFF0C;&#x5219;&#x5C06;&#x8BE5;&#x9875;&#x5199;&#x56DE;&#x78C1;&#x76D8;&#xFF0C;&#x5E76;&#x53D1;&#x751F;&#x4E00;&#x6B21;&#x4E0A;&#x4E0B;&#x6587;&#x5207;&#x6362;&#xFF0C;&#x6302;&#x8D77;&#x4EA7;&#x751F;&#x7F3A;&#x9875;&#x4E2D;&#x65AD;&#x7684;&#x8FDB;&#x7A0B;&#x8BA9;&#x5176;&#x4ED6;&#x8FDB;&#x7A0B;&#x8FD0;&#x884C;&#x76F4;&#x5230;&#x5199;&#x5165;&#x78C1;&#x76D8;&#x7ED3;&#x675F;&#x3002;&#x4E14;&#x56DE;&#x5199;&#x7684;&#x9875;&#x6846;&#x5FC5;&#x987B;&#x6807;&#x8BB0;&#x4E3A;&#x5FD9;&#xFF0C;&#x4EE5;&#x514D;&#x5176;&#x4ED6;&#x539F;&#x56E0;&#x88AB;&#x5176;&#x4ED6;&#x8FDB;&#x7A0B;&#x5360;&#x7528;&#x3002;</p>
<p>6.&#x4E00;&#x65E6;&#x9875;&#x6846;&#x5E72;&#x51C0;&#x540E;&#xFF0C;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x67E5;&#x627E;&#x6240;&#x9700;&#x9875;&#x9762;&#x5728;&#x78C1;&#x76D8;&#x4E0A;&#x7684;&#x5730;&#x5740;&#xFF0C;&#x901A;&#x8FC7;&#x78C1;&#x76D8;&#x64CD;&#x4F5C;&#x5C06;&#x5176;&#x88C5;&#x5165;&#xFF0C;&#x5F53;&#x9875;&#x9762;&#x88AB;&#x88C5;&#x5165;&#x540E;&#xFF0C;&#x4EA7;&#x751F;&#x7F3A;&#x9875;&#x4E2D;&#x65AD;&#x7684;&#x8FDB;&#x7A0B;&#x4ECD;&#x7136;&#x88AB;&#x6302;&#x8D77;&#xFF0C;&#x5E76;&#x4E14;&#x5982;&#x679C;&#x6709;&#x5176;&#x4ED6;&#x53EF;&#x8FD0;&#x884C;&#x7684;&#x7528;&#x6237;&#x8FDB;&#x7A0B;&#xFF0C;&#x5219;&#x9009;&#x62E9;&#x53E6;&#x4E00;&#x7528;&#x6237;&#x8FDB;&#x7A0B;&#x8FD0;&#x884C;&#x3002;</p>
<p>7.&#x5F53;&#x78C1;&#x76D8;&#x4E2D;&#x65AD;&#x53D1;&#x751F;&#x65F6;&#xFF0C;&#x8868;&#x660E;&#x8BE5;&#x9875;&#x5DF2;&#x7ECF;&#x88AB;&#x88C5;&#x5165;&#xFF0C;&#x9875;&#x8868;&#x5DF2;&#x7ECF;&#x66F4;&#x65B0;&#x53EF;&#x4EE5;&#x53CD;&#x6620;&#x4ED6;&#x7684;&#x4F4D;&#x7F6E;&#xFF0C;&#x9875;&#x6846;&#x4E5F;&#x6807;&#x8BB0;&#x4F4D;&#x6B63;&#x5E38;&#x72B6;&#x6001;&#x3002;</p>
<p>8.&#x6062;&#x590D;&#x53D1;&#x751F;&#x7F3A;&#x9875;&#x4E2D;&#x65AD;&#x6307;&#x4EE4;&#x4EE5;&#x524D;&#x7684;&#x72B6;&#x6001;&#xFF0C;&#x7A0B;&#x5E8F;&#x8BA1;&#x6570;&#x5668;&#x91CD;&#x65B0;&#x6307;&#x5411;&#x8FD9;&#x6761;&#x6307;&#x4EE4;&#x3002;</p>
<p>9.&#x8C03;&#x5EA6;&#x5F15;&#x53D1;&#x7F3A;&#x9875;&#x4E2D;&#x65AD;&#x7684;&#x8FDB;&#x7A0B;&#xFF0C;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x8FD4;&#x56DE;&#x8C03;&#x7528;&#x4ED6;&#x7684;&#x6C47;&#x7F16;&#x4F8B;&#x7A0B;</p>
<p>10.&#x8BE5;&#x4F8B;&#x7A0B;&#x6062;&#x590D;&#x5BC4;&#x5B58;&#x5668;&#x548C;&#x5176;&#x4ED6;&#x72B6;&#x6001;&#x4FE1;&#x606F;&#xFF0C;&#x8FD4;&#x56DE;&#x5230;&#x7528;&#x6237;&#x7A7A;&#x95F4;&#x7EE7;&#x7EED;&#x6267;&#x884C;&#xFF0C;&#x5C31;&#x597D;&#x50CF;&#x7F3A;&#x9875;&#x4E2D;&#x65AD;&#x6CA1;&#x6709;&#x53D1;&#x751F;&#x8FC7;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;&#x4E66;&#x4E0A;&#x7684;&#x4F8B;&#x5B50;&#xFF0C;&#x5185;&#x6838;&#x4F1A;&#x4ECE;&#x78C1;&#x76D8;&#x590D;&#x5236;VP 3&#x5230;&#x5185;&#x5B58;&#x4E2D;&#x7684;PP 3&#xFF0C;&#x66F4;&#x65B0;PTE 3&#xFF0C;&#x7136;&#x540E;&#x8FD4;&#x56DE;&#x3002;&#x5F53;&#x5F02;&#x5E38;&#x5904;&#x7406;&#x7A0B;&#x5E8F;&#x8FD4;&#x56DE;&#x65F6;&#xFF0C;&#x5B83;&#x4F1A;&#x91CD;&#x65B0;&#x542F;&#x52A8;&#x5BFC;&#x81F4;&#x7F3A;&#x9875;&#x7684;&#x6307;&#x4EE4;&#xFF0C;&#x8BE5;&#x6307;&#x4EE4;&#x4F1A;&#x628A;&#x5BFC;&#x81F4;&#x7F3A;&#x9875;&#x7684;&#x865A;&#x62DF;&#x5730;&#x5740;&#x91CD;&#x65B0;&#x53D1;&#x9001;&#x5230;&#x5730;&#x5740;&#x7FFB;&#x8BD1;&#x786C;&#x4EF6;&#x3002;&#x4F46;&#x662F;&#x73B0;&#x5728;&#xFF0C;VP 3&#x5DF2;&#x7ECF;&#x7F13;&#x5B58;&#x5728;&#x4E3B;&#x5B58;&#x4E2D;&#x4E86;&#xFF0C;&#x90A3;&#x4E48;&#x9875;&#x547D;&#x4E2D;&#x4E5F;&#x80FD;&#x591F;&#x7531;&#x5730;&#x5740;&#x7FFB;&#x8BD1;&#x786C;&#x4EF6;&#x6B63;&#x5E38;&#x5904;&#x7406;&#x3002;</p>
<p><img src="Users/zhangenshang/Desktop/&#x5927;&#x4F5C;&#x4E1A;&#x7AE0;&#x8282;/Chapter7/&#x5C4F;&#x5E55;&#x5FEB;&#x7167; 2018-12-28 &#x4E0B;&#x5348;8.47.29.png" alt="&#x5C4F;&#x5E55;&#x5FEB;&#x7167; 2018-12-28 &#x4E0B;&#x5348;8.47.29"></p>
<h2 id="79-&#x52A8;&#x6001;&#x5B58;&#x50A8;&#x5206;&#x914D;&#x7BA1;&#x7406;">7.9 &#x52A8;&#x6001;&#x5B58;&#x50A8;&#x5206;&#x914D;&#x7BA1;&#x7406;</h2>
<p><strong>&#x52A8;&#x6001;&#x5185;&#x5B58;&#x5206;&#x914D;</strong>&#x5C31;&#x662F;&#x6307;&#x5728;&#x7A0B;&#x5E8F;&#x6267;&#x884C;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#x52A8;&#x6001;&#x5730;&#x5206;&#x914D;&#x6216;&#x8005;&#x56DE;&#x6536;&#x5B58;&#x50A8;&#x7A7A;&#x95F4;&#x7684;&#x5206;&#x914D;&#x5185;&#x5B58;&#x7684;&#x65B9;&#x6CD5;&#x3002;&#x52A8;&#x6001;&#x5185;&#x5B58;&#x5206;&#x914D;&#x4E0D;&#x8C61;&#x6570;&#x7EC4;&#x7B49;&#x9759;&#x6001;&#x5185;&#x5B58;&#x5206;&#x914D;&#x65B9;&#x6CD5;&#x90A3;&#x6837;&#x9700;&#x8981;&#x9884;&#x5148;&#x5206;&#x914D;&#x5B58;&#x50A8;&#x7A7A;&#x95F4;&#xFF0C;&#x800C;&#x662F;&#x7531;&#x7CFB;&#x7EDF;&#x6839;&#x636E;&#x7A0B;&#x5E8F;&#x7684;&#x9700;&#x8981;&#x5373;&#x65F6;&#x5206;&#x914D;&#xFF0C;&#x4E14;&#x5206;&#x914D;&#x7684;&#x5927;&#x5C0F;&#x5C31;&#x662F;&#x7A0B;&#x5E8F;&#x8981;&#x6C42;&#x7684;&#x5927;&#x5C0F;&#x3002;&#x52A8;&#x6001;&#x5185;&#x5B58;&#x5206;&#x914D;&#x5668;&#x7EF4;&#x62A4;&#x7740;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x7684;&#x865A;&#x62DF;&#x5185;&#x5B58;&#x533A;&#x57DF;&#xFF0C;&#x79F0;&#x4E3A;&#x5806;(heap) &#x3002;&#x7CFB;&#x7EDF;&#x4E4B;&#x95F4;&#x7EC6;&#x8282;&#x4E0D;&#x540C;&#xFF0C;&#x4F46;&#x662F;&#x4E0D;&#x5931;&#x901A;&#x7528;&#x6027;&#xFF0C;&#x5047;&#x8BBE;&#x5806;&#x662F;&#x4E00;&#x4E2A;&#x8BF7;&#x6C42;&#x4E8C;&#x8FDB;&#x5236;&#x96F6;&#x7684;&#x533A;&#x57DF;&#xFF0C;&#x5B83;&#x7D27;&#x63A5;&#x5728;&#x672A;&#x521D;&#x59CB;&#x5316;&#x7684;&#x6570;&#x636E;&#x533A;&#x57DF;&#x540E;&#x5F00;&#x59CB;&#xFF0C;&#x5E76;&#x5411;&#x4E0A;&#x751F;&#x957F;&#xFF08;&#x5411;&#x66F4;&#x9AD8;&#x7684;&#x5730;&#x5740;&#xFF09; &#x3002;&#x5BF9;&#x4E8E;&#x6BCF;&#x4E2A;&#x8FDB;&#x7A0B;&#xFF0C;&#x5185;&#x6838;&#x7EF4;&#x62A4;&#x7740;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;<code>brk</code>, &#x5B83;&#x6307;&#x5411;&#x5806;&#x7684;&#x9876;&#x90E8;&#x3002;&#x5206;&#x914D;&#x5668;&#x5C06;&#x5806;&#x89C6;&#x4E3A;&#x4E00;&#x7EC4;&#x4E0D;&#x540C;&#x5927;&#x5C0F;&#x7684;&#x5757;(block) &#x7684;&#x96C6;&#x5408;&#x6765;&#x7EF4;&#x62A4;&#x3002;&#x6BCF;&#x4E2A;&#x5757;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x8FDE;&#x7EED;&#x7684;&#x865A;&#x62DF;&#x5185;&#x5B58;&#x7247;(chunk),&#x8981;&#x4E48;&#x662F;&#x5DF2;&#x5206;&#x914D;&#x7684;&#xFF0C;&#x8981;&#x4E48;&#x662F;&#x7A7A;&#x95F2;&#x7684;&#x3002;&#x5DF2;&#x5206;&#x914D;&#x7684;&#x5757;&#x663E;&#x5F0F;&#x5730;&#x4FDD;&#x7559;&#x4E3A;&#x4F9B;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4F7F;&#x7528;&#x3002;&#x7A7A;&#x95F2;&#x5757;&#x53EF;&#x7528;&#x6765;&#x5206;&#x914D;&#x3002;&#x7A7A;&#x95F2;&#x5757;&#x4FDD;&#x6301;&#x7A7A;&#x95F2;&#xFF0C;&#x76F4;&#x5230;&#x5B83;&#x663E;&#x5F0F;&#x5730;&#x88AB;&#x5E94;&#x7528;&#x6240;&#x5206;&#x914D;&#x3002;&#x4E00;&#x4E2A;&#x5DF2;&#x5206;&#x914D;&#x7684;&#x5757;&#x4FDD;&#x6301;&#x5DF2;&#x5206;&#x914D;&#x72B6;&#x6001;&#xFF0C;&#x76F4;&#x5230;&#x5B83;&#x88AB;&#x91CA;&#x653E;&#xFF0C;&#x8FD9;&#x79CD;&#x91CA;&#x653E;&#x8981;&#x4E48;&#x662F;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x663E;&#x5F0F;&#x6267;&#x884C;&#x7684;&#xFF0C;&#x8981;&#x4E48;&#x662F;&#x5185;&#x5B58;&#x5206;&#x914D;&#x5668;&#x81EA;&#x8EAB;&#x9690;&#x5F0F;&#x6267;&#x884C;&#x7684;&#x3002;</p>
<p>&#x5206;&#x914D;&#x5668;&#x6709;&#x4E24;&#x79CD;&#x57FA;&#x672C;&#x98CE;&#x683C;&#xFF1A;</p>
<ul>
<li><strong>&#x663E;&#x5F0F;&#x5206;&#x914D;&#x5668;</strong>&#x3002;&#x8981;&#x6C42;&#x5E94;&#x7528;&#x663E;&#x5F0F;&#x5730;&#x91CA;&#x653E;&#x4EFB;&#x4F55;&#x5DF2;&#x5206;&#x914D;&#x7684;&#x5757;&#x3002;</li>
<li><strong>&#x9690;&#x5F0F;&#x5206;&#x914D;&#x5668;</strong>&#x3002;&#x8981;&#x6C42;&#x5206;&#x914D;&#x5668;&#x68C0;&#x6D4B;&#x4E00;&#x4E2A;&#x5DF2;&#x5206;&#x914D;&#x5757;&#x4F55;&#x65F6;&#x4E0D;&#x518D;&#x88AB;&#x7A0B;&#x5E8F;&#x6240;&#x4F7F;&#x7528;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x91CA;&#x653E;&#x8FD9;&#x4E2A;&#x5757;&#xFF0C;</li>
</ul>
<p>C&#x6807;&#x51C6;&#x5E93;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E2A;&#x79F0;&#x4E3A;<code>malloc</code>&#x7A0B;&#x5E8F;&#x5305;&#x7684;&#x663E;&#x5F0F;&#x5206;&#x914D;&#x5668;&#x3002;&#x7A0B;&#x5E8F;&#x901A;&#x8FC7;&#x8C03;&#x7528;malloc&#x51FD;&#x6570;&#x6765;&#x4ECE;&#x5806;&#x4E2D;&#x5206;&#x914D;&#x5757;&#x3002;malloc&#x51FD;&#x6570;&#x8FD4;&#x56DE;&#x4E00;&#x4E2A;&#x6307;&#x9488;&#xFF0C;&#x6307;&#x5411;&#x5927;&#x5C0F;&#x4E3A;&#x81F3;&#x5C11;size&#x5B57;&#x8282;&#x7684;&#x5185;&#x5B58;&#x5757;&#xFF0C;&#x8FD9;&#x4E2A;&#x5757;&#x4F1A;&#x4E3A;&#x53EF;&#x80FD;&#x5305;&#x542B;&#x5728;&#x8FD9;&#x4E2A;&#x5757;&#x4E2D;&#x7684;&#x4EFB;&#x4F55;&#x6570;&#x636E;&#x5BF9;&#x8C61;&#x7C7B;&#x578B;&#x505A;&#x5BF9;&#x9F50;&#x3002;&#x5982;&#x679C;malloc&#x9047;&#x5230;&#x95EE;&#x9898;&#xFF0C;&#x90A3;&#x4E48;&#x5B83;&#x5C31;&#x8FD4;&#x56DE;null&#x3002;</p>
<p>&#x5BF9;&#x4E8E;&#x4EFB;&#x4F55;&#x5206;&#x914D;&#x5668;&#xFF0C;&#x5B83;&#x4EEC;&#x7684;&#x76EE;&#x6807;&#x90FD;&#x662F;&#x5728;&#x6574;&#x4E2A;&#x5E8F;&#x5217;&#x4E2D;&#x4F7F;&#x5F97;&#x5CF0;&#x503C;&#x5229;&#x7528;&#x7387;&#x6700;&#x5927;&#x5316;&#x3002;&#x4F46;&#x662F;&#x6700;&#x5927;&#x5316;&#x5185;&#x5B58;&#x5229;&#x7528;&#x7387;&#x548C;&#x6700;&#x5927;&#x5316;&#x541E;&#x5410;&#x7387;&#x65F6;&#x4E92;&#x76F8;&#x7275;&#x5236;&#x7684;&#x3002;&#x6240;&#x4EE5;&#x6700;&#x7EC8;&#x7684;&#x76EE;&#x6807;&#x5C31;&#x662F;&#x5728;&#x4E24;&#x4E2A;&#x76EE;&#x6807;&#x4E4B;&#x95F4;&#x627E;&#x5230;&#x4E00;&#x4E2A;&#x9002;&#x5F53;&#x7684;&#x5E73;&#x8861;&#x3002;</p>
<p>&#x4EFB;&#x4F55;&#x5B9E;&#x9645;&#x7684;&#x5206;&#x914D;&#x5668;&#x90FD;&#x9700;&#x8981;&#x4E00;&#x4E9B;&#x6570;&#x636E;&#x7ED3;&#x6784;&#xFF0C;&#x5141;&#x8BB8;&#x5B83;&#x6765;&#x533A;&#x522B;&#x5757;&#x8FB9;&#x754C;&#xFF0C;&#x4EE5;&#x53CA;&#x533A;&#x522B;&#x5DF2;&#x5206;&#x914D;&#x5757;&#x548C;&#x7A7A;&#x95F2;&#x5757;&#x3002;&#x5927;&#x591A;&#x6570;&#x5206;&#x914D;&#x5668;&#x5C06;&#x8FD9;&#x4E9B;&#x4FE1;&#x606F;&#x5D4C;&#x5165;&#x5757;&#x672C;&#x8EAB;&#x3002;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x65B9;&#x6CD5;&#x5982;&#x56FE;&#x6240;&#x793A;&#x3002;<img src="Users/zhangenshang/Desktop/&#x5927;&#x4F5C;&#x4E1A;&#x7AE0;&#x8282;/Chapter7/&#x5C4F;&#x5E55;&#x5FEB;&#x7167; 2018-12-28 &#x4E0B;&#x5348;9.08.50.png" alt="&#x5C4F;&#x5E55;&#x5FEB;&#x7167; 2018-12-28 &#x4E0B;&#x5348;9.08.50"></p>
<p>&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4E00;&#x4E2A;&#x5757;&#x662F;&#x6709;&#x4E00;&#x4E2A;&#x5B57;&#x7684;&#x5934;&#x90E8;&#x3001;&#x6709;&#x6548;&#x8F7D;&#x8377;&#xFF0C;&#x4EE5;&#x53CA;&#x53EF;&#x80FD;&#x7684;&#x4E00;&#x4E9B;&#x989D;&#x5916;&#x7684;&#x586B;&#x5145;&#x7EC4;&#x6210;&#x7684;&#x3002;&#x5934;&#x90E8;&#x7F16;&#x7801;&#x4E86;&#x8FD9;&#x4E2A;&#x5757;&#x7684;&#x5927;&#x5C0F;&#xFF0C;&#x4EE5;&#x53CA;&#x8FD9;&#x4E2A;&#x5757;&#x662F;&#x5DF2;&#x5206;&#x914D;&#x7684;&#x8FD8;&#x662F;&#x7A7A;&#x95F2;&#x7684;&#x3002;&#x5934;&#x90E8;&#x540E;&#x9762;&#x5C31;&#x662F;&#x5E94;&#x7528;&#x8C03;&#x7528;malloc&#x65F6;&#x8BF7;&#x6C42;&#x7684;&#x6709;&#x6548;&#x8F7D;&#x8377;&#xFF0C;&#x6709;&#x6548;&#x8F7D;&#x8377;&#x540E;&#x9762;&#x662F;&#x4E00;&#x7247;&#x4E0D;&#x4F7F;&#x7528;&#x7684;&#x586B;&#x5145;&#x5757;&#xFF0C;&#x5176;&#x5927;&#x5C0F;&#x53EF;&#x4EE5;&#x662F;&#x4EFB;&#x610F;&#x7684;&#x3002;</p>
<p>&#x5047;&#x8BBE;&#x5757;&#x7684;&#x683C;&#x5F0F;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5C06;&#x5806;&#x7EC4;&#x7EC7;&#x6210;&#x4E00;&#x4E2A;&#x8FDE;&#x7EED;&#x7684;&#x5DF2;&#x5206;&#x914D;&#x5757;&#x548C;&#x7A7A;&#x95F2;&#x5757;&#x7684;&#x5E8F;&#x5217;&#xFF1A;<img src="Users/zhangenshang/Desktop/&#x5927;&#x4F5C;&#x4E1A;&#x7AE0;&#x8282;/Chapter7/&#x5C4F;&#x5E55;&#x5FEB;&#x7167; 2018-12-28 &#x4E0B;&#x5348;9.11.56.png" alt="&#x5C4F;&#x5E55;&#x5FEB;&#x7167; 2018-12-28 &#x4E0B;&#x5348;9.11.56"></p>
<p>&#x6211;&#x4EEC;&#x79F0;&#x8FD9;&#x79CD;&#x7ED3;&#x6784;&#x4E3A;&#x9690;&#x5F0F;&#x7A7A;&#x95F2;&#x94FE;&#x8868;&#xFF0C;&#x662F;&#x56E0;&#x4E3A;&#x7A7A;&#x95F2;&#x5757;&#x662F;&#x901A;&#x8FC7;&#x5934;&#x90E8;&#x4E2D;&#x7684;&#x5927;&#x5C0F;&#x5B57;&#x6BB5;&#x9690;&#x542B;&#x5730;&#x8FDE;&#x63A5;&#x7740;&#x7684;&#x3002;&#x5206;&#x914D;&#x5668;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x904D;&#x5386;&#x5806;&#x4E2D;&#x6240;&#x6709;&#x7684;&#x5757;&#xFF0C;&#x4ECE;&#x800C;&#x95F4;&#x63A5;&#x5730;&#x4FBF;&#x5229;&#x6574;&#x4E2A;&#x7A7A;&#x95F2;&#x5757;&#x7684;&#x96C6;&#x5408;&#x3002;&#x6CE8;&#x610F;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x67D0;&#x79CD;&#x7279;&#x6B8A;&#x6807;&#x8BB0;&#x7684;&#x7ED3;&#x675F;&#x5757;&#x3002;&#x9690;&#x5F0F;&#x7A7A;&#x95F2;&#x94FE;&#x8868;&#x7684;&#x4F18;&#x70B9;&#x662F;&#x7B80;&#x5355;&#x3002;&#x663E;&#x8457;&#x7684;&#x7F3A;&#x70B9;&#x662F;&#x4EFB;&#x4F55;&#x64CD;&#x4F5C;&#x7684;&#x5F00;&#x9500;&#xFF0C;&#x4F8B;&#x5982;&#x653E;&#x7F6E;&#x5206;&#x914D;&#x7684;&#x5757;&#xFF0C;&#x8981;&#x6C42;&#x5BF9;&#x7A7A;&#x95F2;&#x94FE;&#x8868;&#x8FDB;&#x884C;&#x641C;&#x7D22;&#xFF0C;&#x8BE5;&#x641C;&#x7D22;&#x6240;&#x9700;&#x7684;&#x65F6;&#x95F4;&#x4E0E;&#x5806;&#x4E2D;&#x5DF2;&#x5206;&#x914D;&#x5757;&#x548C;&#x7A7A;&#x95F2;&#x5757;&#x7684;&#x603B;&#x6570;&#x5448;&#x7EBF;&#x6027;&#x5173;&#x7CFB;&#x3002;&#x5F53;&#x5E94;&#x7528;&#x8BF7;&#x6C42;&#x4E00;&#x4E2A;k&#x5B57;&#x8282;&#x7684;&#x5757;&#x65F6;&#xFF0C;&#x5206;&#x914D;&#x5668;&#x641C;&#x7D22;&#x7A7A;&#x95F2;&#x94FE;&#x8868;&#xFF0C;&#x67E5;&#x627E;&#x4E00;&#x4E2A;&#x8DB3;&#x591F;&#x5927;&#x53EF;&#x4EE5;&#x653E;&#x7F6E;&#x6240;&#x8BF7;&#x6C42;&#x5757;&#x7684;&#x7A7A;&#x95F2;&#x5757;&#x3002;&#x5206;&#x914D;&#x5668;&#x6267;&#x884C;&#x8FD9;&#x79CD;&#x641C;&#x7D22;&#x7684;&#x65B9;&#x5F0F;&#x662F;&#x7531;<strong>&#x653E;&#x7F6E;&#x7B56;&#x7565;</strong>&#x786E;&#x5B9A;&#x7684;&#x3002;&#x4E00;&#x4E9B;&#x5E38;&#x89C1;&#x7684;&#x7B56;&#x7565;&#x662F;<strong>&#x9996;&#x6B21;&#x9002;&#x914D;</strong>&#x3001;<strong>&#x4E0B;&#x4E00;&#x6B21;&#x9002;&#x914D;</strong>&#x3001;<strong>&#x6700;&#x4F73;&#x9002;&#x914D;</strong>&#x3002;</p>
<ul>
<li>&#x9996;&#x6B21;&#x9002;&#x914D;&#x4ECE;&#x5934;&#x5F00;&#x59CB;&#x641C;&#x7D22;&#x7A7A;&#x95F2;&#x94FE;&#x8868;&#xFF0C;&#x9009;&#x62E9;&#x7B2C;&#x4E00;&#x4E2A;&#x5408;&#x9002;&#x7684;&#x7A7A;&#x95F2;&#x5757;&#x3002;&#x4F18;&#x70B9;&#x662F;&#x5B83;&#x8D8B;&#x5411;&#x4E8E;&#x5C06;&#x5927;&#x7684;&#x7A7A;&#x95F2;&#x5757;&#x4FDD;&#x7559;&#x5728;&#x94FE;&#x8868;&#x7684;&#x540E;&#x9762;&#x3002;&#x7F3A;&#x70B9;&#x662F;&#x5B83;&#x8D8B;&#x5411;&#x4E8E;&#x5728;&#x9760;&#x8FD1;&#x94FE;&#x8868;&#x8D77;&#x59CB;&#x5904;&#x7559;&#x4E0B;&#x5C0F;&#x7A7A;&#x95F2;&#x5757;&#x7684;&#x201C;&#x788E;&#x7247;&#x201C;&#xFF0C;&#x8FD9;&#x5C31;&#x589E;&#x52A0;&#x4E86;&#x5BF9;&#x8F83;&#x5927;&#x5757;&#x7684;&#x641C;&#x7D22;&#x65F6;&#x95F4;&#x3002;&#x5728;&#x9690;&#x5F0F;&#x7A7A;&#x95F2;&#x94FE;&#x8868;&#x4E2D;&#xFF0C;&#x4F7F;&#x7528;&#x6700;&#x4F73;&#x9002;&#x914D;&#x7684;&#x7F3A;&#x70B9;&#x662F;&#x5B83;&#x8981;&#x6C42;&#x5BF9;&#x5806;&#x8FDB;&#x884C;&#x5F7B;&#x5E95;&#x7684;&#x641C;&#x7D22;&#x3002;</li>
<li>&#x4E0B;&#x4E00;&#x6B21;&#x9002;&#x914D;&#x662F;&#x4ECE;&#x4E0A;&#x4E00;&#x6B21;&#x67E5;&#x8BE2;&#x7ED3;&#x675F;&#x7684;&#x5730;&#x65B9;&#x5F00;&#x59CB;&#x67E5;&#x8BE2;&#x3002;</li>
<li>&#x6700;&#x4F73;&#x9002;&#x914D;&#x662F;&#x68C0;&#x67E5;&#x6BCF;&#x4E00;&#x4E2A;&#x7A7A;&#x95F2;&#x5757;&#xFF0C;&#x9009;&#x62E9;&#x9002;&#x5408;&#x6240;&#x9700;&#x8BF7;&#x6C42;&#x7684;&#x6700;&#x5C0F;&#x7A7A;&#x95F2;&#x5757;&#x3002;&#x5B83;&#x7684;&#x5185;&#x5B58;&#x5229;&#x7528;&#x7387;&#x6700;&#x9AD8;&#x3002;</li>
</ul>
<p>&#x5F53;&#x5B58;&#x5728;&#x53EF;&#x7528;&#x7684;&#x7A7A;&#x95F2;&#x5757;&#x88AB;&#x5206;&#x5272;&#x4E3A;&#x5C0F;&#x7684;&#x3001;&#x65E0;&#x6CD5;&#x4F7F;&#x7528;&#x7684;&#x7A7A;&#x95F2;&#x5757;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x4EEC;&#x8981;&#x5B9E;&#x73B0;<strong>&#x5408;&#x5E76;&#x7A7A;&#x95F2;&#x5757;</strong>&#xFF0C;&#x5408;&#x5E76;&#x7A7A;&#x95F2;&#x5757;&#x6709;<strong>&#x7ACB;&#x5373;&#x5408;&#x5E76;</strong>&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x5728;&#x6BCF;&#x6B21;&#x4E00;&#x4E2A;&#x5757;&#x88AB;&#x91CA;&#x653E;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5C31;&#x5408;&#x5E76;&#x6240;&#x6709;&#x7684;&#x76F8;&#x90BB;&#x5757;&#x3002;&#x8FD8;&#x6709;<strong>&#x63A8;&#x8FDF;&#x5408;&#x5E76;</strong>&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x7B49;&#x5230;&#x67D0;&#x4E2A;&#x7A0D;&#x665A;&#x7684;&#x65F6;&#x5019;&#x518D;&#x5408;&#x5E76;&#x7A7A;&#x95F2;&#x5757;&#x3002;&#x7ACB;&#x5373;&#x5408;&#x5E76;&#x5F88;&#x7B80;&#x5355;&#x660E;&#x4E86;&#xFF0C;&#x53EF;&#x4EE5;&#x5728;&#x5E38;&#x6570;&#x65F6;&#x95F4;&#x5185;&#x6267;&#x884C;&#x5B8C;&#x6210;&#xFF0C;&#x4F46;&#x662F;&#x5BF9;&#x4E8E;&#x67D0;&#x4E9B;&#x8BF7;&#x6C42;&#x65B9;&#x5F0F;&#xFF0C;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x4F1A;&#x4EA7;&#x751F;&#x4E00;&#x79CD;&#x5F62;&#x5F0F;&#x7684;&#x6296;&#x52A8;&#xFF0C;&#x5757;&#x4F1A;&#x53CD;&#x590D;&#x7684;&#x5408;&#x5E76;&#xFF0C;&#x7136;&#x540E;&#x9A6C;&#x4E0A;&#x5206;&#x5272;&#x3002;</p>
<p>&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x7ED3;&#x6784;&#x662F;&#x663E;&#x5F0F;&#x7A7A;&#x95F2;&#x94FE;&#x8868;&#xFF0C;&#x5C06;&#x7A7A;&#x95F2;&#x5757;&#x7EC4;&#x7EC7;&#x6210;&#x94FE;&#x8868;&#x5F62;&#x5F0F;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x3002;&#x5806;&#x53EF;&#x4EE5;&#x7EC4;&#x7EC7;&#x6210;&#x4E00;&#x4E2A;&#x53CC;&#x5411;&#x7A7A;&#x95F2;&#x94FE;&#x8868;&#xFF0C;&#x5728;&#x6BCF;&#x4E2A;&#x7A7A;&#x95F2;&#x5757;&#x4E2D;&#xFF0C;&#x90FD;&#x5305;&#x542B;&#x4E00;&#x4E2A;pred&#xFF08;&#x524D;&#x9A71;&#xFF09;&#x548C;succ&#xFF08;&#x540E;&#x7EE7;&#xFF09;&#x6307;&#x9488;&#xFF0C;&#x5982;&#x4E0B;&#x56FE;&#xFF1A;</p>
<p><img src="Users/zhangenshang/Desktop/&#x5927;&#x4F5C;&#x4E1A;&#x7AE0;&#x8282;/Chapter7/&#x5C4F;&#x5E55;&#x5FEB;&#x7167; 2018-12-28 &#x4E0B;&#x5348;9.29.04.png" alt="&#x5C4F;&#x5E55;&#x5FEB;&#x7167; 2018-12-28 &#x4E0B;&#x5348;9.29.04"></p>
<p>&#x4F7F;&#x7528;&#x53CC;&#x5411;&#x94FE;&#x8868;&#x800C;&#x4E0D;&#x662F;&#x9690;&#x5F0F;&#x7A7A;&#x95F2;&#x94FE;&#x8868;&#xFF0C;&#x4F7F;&#x9996;&#x6B21;&#x9002;&#x914D;&#x7684;&#x5206;&#x914D;&#x65F6;&#x95F4;&#x4ECE;&#x5757;&#x603B;&#x6570;&#x7684;&#x7EBF;&#x6027;&#x65F6;&#x95F4;&#x51CF;&#x5C11;&#x5230;&#x4E86;&#x7A7A;&#x95F2;&#x5757;&#x6570;&#x91CF;&#x7684;&#x7EBF;&#x6027;&#x65F6;&#x95F4;&#x3002;&#x91CA;&#x653E;&#x4E00;&#x4E2A;&#x5757;&#x7684;&#x65F6;&#x95F4;&#x53D6;&#x51B3;&#x4E8E;&#x6211;&#x4EEC;&#x7684;&#x6392;&#x5E8F;&#x7B56;&#x7565;&#xFF0C;&#x4E00;&#x79CD;&#x662F;<strong>&#x540E;&#x8FDB;&#x5148;&#x51FA;</strong>&#xFF08;LIFO&#xFF09;&#x7684;&#x987A;&#x5E8F;&#x7EF4;&#x62A4;&#x94FE;&#x8868;&#xFF0C;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x91CA;&#x653E;&#x4E00;&#x4E2A;&#x5757;&#x53EF;&#x4EE5;&#x5728;&#x5E38;&#x6570;&#x65F6;&#x95F4;&#x5185;&#x5B8C;&#x6210;&#x3002;&#x5982;&#x679C;&#x4F7F;&#x7528;&#x4E86;&#x8FB9;&#x754C;&#x6807;&#x8BB0;&#xFF0C;&#x90A3;&#x4E48;&#x5408;&#x5E76;&#x4E5F;&#x53EF;&#x4EE5;&#x5728;&#x5E38;&#x6570;&#x65F6;&#x95F4;&#x5185;&#x5B8C;&#x6210;&#x3002;&#x53E6;&#x4E00;&#x79CD;&#x662F;&#x6309;&#x7167;<strong>&#x5730;&#x5740;&#x987A;&#x5E8F;</strong>&#x6765;&#x7EF4;&#x62A4;&#x94FE;&#x8868;&#x3002;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x7684;&#x9996;&#x6B21;&#x9002;&#x914D;&#x6BD4;LIFO&#x6392;&#x5E8F;&#x7684;&#x9996;&#x6B21;&#x9002;&#x914D;&#x6709;&#x66F4;&#x9AD8;&#x7684;&#x5185;&#x5B58;&#x5229;&#x7528;&#x7387;&#xFF0C;&#x63A5;&#x8FD1;&#x6700;&#x4F73;&#x9002;&#x914D;&#x7684;&#x5229;&#x7528;&#x7387;&#x3002;</p>
<p>&#x4E00;&#x4E2A;&#x4F7F;&#x7528;&#x5355;&#x9879;&#x7A7A;&#x95F2;&#x5757;&#x94FE;&#x8868;&#x7684;&#x5206;&#x914D;&#x5668;&#x9700;&#x8981;&#x4E0E;&#x7A7A;&#x95F2;&#x5757;&#x6570;&#x91CF;&#x5448;&#x7EBF;&#x6027;&#x5173;&#x7CFB;&#x7684;&#x65F6;&#x95F4;&#x6765;&#x5206;&#x914D;&#x5757;&#x3002;&#x4E00;&#x79CD;&#x6D41;&#x884C;&#x7684;&#x51CF;&#x5C11;&#x5206;&#x914D;&#x65F6;&#x95F4;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x901A;&#x5E38;&#x79F0;&#x4E3A;<strong>&#x5206;&#x79BB;&#x5B58;&#x50A8;</strong>&#xFF0C;&#x5C31;&#x662F;&#x7EF4;&#x62A4;&#x591A;&#x4E2A;&#x7A7A;&#x95F2;&#x94FE;&#x8868;&#x3002;&#x5206;&#x79BB;&#x5B58;&#x50A8;&#x7684;&#x4E24;&#x79CD;&#x57FA;&#x672C;&#x7684;&#x65B9;&#x6CD5;&#x662F;<strong>&#x7B80;&#x5355;&#x5206;&#x79BB;&#x5B58;&#x50A8;</strong>&#x548C;<strong>&#x5206;&#x79BB;&#x9002;&#x914D;</strong>&#x3002;</p>
<h2 id="710-&#x672C;&#x7AE0;&#x5C0F;&#x7ED3;">7.10 &#x672C;&#x7AE0;&#x5C0F;&#x7ED3;</h2>
<p>Hello&#x5728;Linux&#x7684;&#x5B58;&#x50A8;&#x4E2D;&#xFF0C;&#x5728;&#x4E0D;&#x540C;&#x65F6;&#x523B;&#xFF0C;&#x90FD;&#x5B58;&#x50A8;&#x7684;&#x5F62;&#x5F0F;&#x90FD;&#x4E0D;&#x540C;&#x3002;&#x865A;&#x62DF;&#x5185;&#x5B58;&#x662F;&#x5BF9;&#x4E3B;&#x5B58;&#x7684;&#x62BD;&#x8C61;&#x3002;&#x73B0;&#x4EE3;&#x7CFB;&#x7EDF;&#x901A;&#x8FC7;&#x5C06;&#x865A;&#x62DF;&#x5185;&#x5B58;&#x7247;&#x548C;&#x78C1;&#x76D8;&#x4E0A;&#x7684;&#x6587;&#x4EF6;&#x7247;&#x5173;&#x8054;&#x8D77;&#x6765;&#xFF0C;&#x6765;&#x5B9E;&#x73B0;&#x5B58;&#x50A8;&#x7684;&#x529F;&#x80FD;&#x3002;&#x672C;&#x7AE0;&#x4E3B;&#x8981;&#x4ECB;&#x7ECD;&#x4E86;hello&#x7684;&#x5B58;&#x50A8;&#x5668;&#x5730;&#x5740;&#x7A7A;&#x95F4;&#x3001;intel&#x7684;&#x6BB5;&#x5F0F;&#x7BA1;&#x7406;&#x3001;hello&#x7684;&#x9875;&#x5F0F;&#x7BA1;&#x7406;&#xFF0C;&#x4EE5;intel Core7&#x5728;&#x6307;&#x5B9A;&#x73AF;&#x5883;&#x4E0B;&#x4ECB;&#x7ECD;&#x4E86;VA&#x5230;PA&#x7684;&#x53D8;&#x6362;&#x3001;&#x7269;&#x7406;&#x5185;&#x5B58;&#x8BBF;&#x95EE;&#xFF0C;&#x8FD8;&#x4ECB;&#x7ECD;&#x4E86;hello&#x8FDB;&#x7A0B;fork&#x65F6;&#x7684;&#x5185;&#x5B58;&#x6620;&#x5C04;&#x3001;execve&#x65F6;&#x7684;&#x5185;&#x5B58;&#x6620;&#x5C04;&#x3001;&#x7F3A;&#x9875;&#x6545;&#x969C;&#x4E0E;&#x7F3A;&#x9875;&#x4E2D;&#x65AD;&#x5904;&#x7406;&#x3001;&#x52A8;&#x6001;&#x5B58;&#x50A8;&#x5206;&#x914D;&#x7BA1;&#x7406;&#x3002;</p>

                    
                    </section>
                
                
                </div>
            </div>
        </div>

        
        <a href="./chapter6.html" class="navigation navigation-prev " aria-label="Previous page: 第六章"><i class="fa fa-angle-left"></i></a>
        
        
        <a href="./chapter8.html" class="navigation navigation-next " aria-label="Next page: 第八章"><i class="fa fa-angle-right"></i></a>
        
    </div>
</div>

        
<script src="gitbook/app.js"></script>

    
    <script src="gitbook/plugins/gitbook-plugin-search/lunr.min.js"></script>
    

    
    <script src="gitbook/plugins/gitbook-plugin-search/search.js"></script>
    

    
    <script src="gitbook/plugins/gitbook-plugin-sharing/buttons.js"></script>
    

    
    <script src="gitbook/plugins/gitbook-plugin-fontsettings/buttons.js"></script>
    

<script>
require(["gitbook"], function(gitbook) {
    var config = {"highlight":{},"search":{"maxIndexSize":1000000},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2}};
    gitbook.start(config);
});
</script>

        
    </body>
    
</html>
